changelog/changelog.org
** 1.84
- 2025-01-08
*** General Changes
- Removed MaintenanceCostEnergyPerSecond from T2 and T3 Sniper as It
  wasn't needed to balance the unit and It was not working as intended.

*** Comment:
Energy Review was done in order to account more accurately for Stealth /
Mobile Stealth as It should be treated in a similar way to Mobile
Shields & Personal Shields. =The Following Changes were made:=
**** T4 UEF Star Adder
  - MaintenanceCostEnergyPerSecond: 80 -> 1250
  - Radar Radius: 64 -> 42
  - RegenRate: 12 -> 6 - Speed: 3.5 -> 2.8
**** T3 UEF Juggernaut
  - MaintenanceCostEnergyPerSecond: 20 -> 95
**** T4 UEF Dragonite
  - MaintenanceCostEnergyPerSecond: 212 -> 850
  - Veterancy Kills Required Increased
**** T4 UEF Fatboy
  - MaintenanceCostEnergyPerSecond: 400 -> 950
**** T4 UEF Mayhem
  - RegenRate: 40 -> 15
  - Radar Radius: 96 -> 64
  - Sonar Radius: 60 -> 64
  - Omni Radar Removed
**** T4 UEF Bloodasp
  - RegenRate: 14 -> 7
  - Speed: 3.0 -> 2.9
  - Veterancy Kills Required Increased
**** T4 UEF Goliath
  - RegenRate: 30 -> 20
  - Radar Radius: 96 -> 64
  - Max Acceleration: 2.8 -> 1.6
**** T4 Cybran Megalith
  - BuildRate: 180 -> 200
  - Radar Radius: 96 -> 56
  - Sonar Radius: 60 -> 56
  - Max Acceleration: 2.4 -> 1.2
**** T4 Cybran Storm Strider*
  - Anti Air Damage: 48 -> 24 (Had 480 DPS in AA but now
has 240)
  - Unit Cap: 8 -> 10
  - Rader Radius: 96 -> 56
  - Stealth Removed
**** T4 Cybran Megaroach
  - Anti Air Damage: 50 -> 25 (Had 800 DPS
in AA but now has 400)
  - RegenRate: 48 -> 24
  - Omni Radar Removed
  - Stealth Removed
  - Radar Radius: 96 -> 56
**** T4 Cybran Madbolo
  - Fixed Rate Of Rate
  - Rocket Barrage Damage: 375 -> 300
**** T4 Cybran Basilisk
  - Unit Cap: 7 -> 12
  - *Anti Air*
    =This Unit now had 2.2k DPS in AA but now has 600 DPS in AA=
  - DoT Pulse: 5 -> 3
  - MuzzleSalvoSize: 6 -> 4
  - Rate of Fire: 0.6 -> 0.5
**** T4 Cybran Avalanche
  - Max Speed: 2.4 -> 1.8 (This thing was as fast as a
Basilisk for context)
  - Radar Radius: 96 -> 56
  - RegenRate: 40 -> 20
**** T4 Seraphim Yenah-lao
  - Max Speed: 3.0 -> 2.6
  - Regen Rate: 15 -> 10
  - Stealth Removed
**** T4 Seraphim Tha-Yath
  - Cost Mass: 10000 -> 12500
  - Cost Energy: 80000 -> 90000
  - Max Speed: 3.3 -> 3.0
  - Stealth Removed
  - Free Intel Removed *Anti Air*
  - Anti Air Damage: 72 -> 102
  - DamageRadius: 2.4 -> 4
  - Max Radius: 40 -> 60
**** T4 Seraphim Athusil
  - Max Speed: 2.9 -> 2.6
  - Regen Rate: 20 -> 10
  - Radar Removed
  - Stealth Removed
**** T4 Seraphim Thaez-Atha
  - MaintenanceCostEnergyPerSecond: 900 -> 2150 (Due to Stealth Field & Personal Stealth)
  - Radar Radius: 96 -> 64
  - Omni Removed
**** T4 Seraphim Yath-Us
  - Max Speed: 3.4 -> 3.0
  - Stealth Removed
**** T4 Seraphim Yenzotha
  - Max Speed: 3.3 -> 3.0
  - Max Acceleration: 1.0 -> 1.5
**** T4 Seraphim Seth Ilhaas
  - Radar Radius: 64 -> 56
  - Max Speed: 3.4 -> 3.0
  - Max Acceleration: 1.0 -> 1.5
**** T4 Seraphim Ythotha
  - Max Speed: 2.6 -> 2.4
  - Max Acceleration: 1.6 -> 1.2
  - Regen Rate: 20 -> 10
**** T4 Aeon Inquisitor
  - Max Acceleration: 0.35 -> 1.3
  - Radar Added (56 Radius)
  - Stealth Removed
**** T4 Aeon Genesis
  - Cost Mass: 19000 -> 26000
  - Cost Energy: 385000 -> 435000
  - Max Speed: 3.3 -> 2.6
  - Max Acceleration: 1.1 -> 1.3
**** T4 Aeon Interrogater
  - Stealth Removed
**** T4 Aeon Elias
  - Unit Cap: 4 -> 6
  - Max Speed: 2.9 -> 2.6
**** T4 Aeon Absolution
  - Max Health: 36000 -> 23000
  - Regen Rate: 12 -> 6
**** T3 Cybran Operative
  - Unit Cap: 1 -> 3
  - MaintenanceCostEnergyPerSecond: 150 -> 465
  - RadarStealthFieldRadius: 28 -> 24
**** T2 Cybran Deceiver
  - Unit Cap: 1 -> 2
  - MaintenanceCostEnergyPerSecond: 40 -> 190
  - RadarStealthFieldRadius: 20 -> 16
**** T2 Cybran Hoptile
  - FiringRandomnessWhileMoving: 0.2 -> 0.45
  - Max Radius: 37 -> 36
**** T2 Cybran Hippo
  - Damage Radius: 1.42 -> 1.25
  - Damage: 25 -> 20
**** T3 Cybran Hailfire
  - FiringRandomnessWhileMoving: 0.5 -> 1.25
**** T3 Cybran Triseptitron
  - Damage: 215 -> 185
  - Damage Radius: 2.5 -> 2.25
  - Added FiringRandomnessWhileMoving: 5.5
**** T3 Cybran Mastodon
  - FiringRandomnessWhileMoving: 0 -> 1.5
  - Damage: 55 -> 35
**** T2 UEF Mongoose
  - Damage: 15 -> 12 (Gatling Gun)

** 1.83
- 2025-01-05
