changelog/changelog.html

<div id="outline-container-org6f7d8a0" class="outline-2">
<h2 id="org6f7d8a0">1.84</h2>
<div class="outline-text-2" id="text-org6f7d8a0">
<ul class="org-ul">
<li>2025-01-08</li>
</ul>
</div>
<div id="outline-container-orgdd26ac2" class="outline-3">
<h3 id="orgdd26ac2">General Changes</h3>
<div class="outline-text-3" id="text-orgdd26ac2">
<ul class="org-ul">
<li>Removed MaintenanceCostEnergyPerSecond from T2 and T3 Sniper as It
wasn't needed to balance the unit and It was not working as intended.</li>
</ul>
</div>
</div>

<div id="outline-container-org1762b4a" class="outline-3">
<h3 id="org1762b4a">Comment:</h3>
<div class="outline-text-3" id="text-org1762b4a">
<p>
Energy Review was done in order to account more accurately for Stealth /
Mobile Stealth as It should be treated in a similar way to Mobile
Shields &amp; Personal Shields. <code>The Following Changes were made:</code>
</p>
</div>
<div id="outline-container-org104cada" class="outline-4">
<h4 id="org104cada">T4 UEF Star Adder</h4>
<div class="outline-text-4" id="text-org104cada">
<ul class="org-ul">
<li>MaintenanceCostEnergyPerSecond: 80 -&gt; 1250</li>
<li>Radar Radius: 64 -&gt; 42</li>
<li>RegenRate: 12 -&gt; 6 - Speed: 3.5 -&gt; 2.8</li>
</ul>
</div>
</div>
<div id="outline-container-orgb80eecb" class="outline-4">
<h4 id="orgb80eecb">T3 UEF Juggernaut</h4>
<div class="outline-text-4" id="text-orgb80eecb">
<ul class="org-ul">
<li>MaintenanceCostEnergyPerSecond: 20 -&gt; 95</li>
</ul>
</div>
</div>
<div id="outline-container-orgbe97c90" class="outline-4">
<h4 id="orgbe97c90">T4 UEF Dragonite</h4>
<div class="outline-text-4" id="text-orgbe97c90">
<ul class="org-ul">
<li>MaintenanceCostEnergyPerSecond: 212 -&gt; 850</li>
<li>Veterancy Kills Required Increased</li>
</ul>
</div>
</div>
<div id="outline-container-orgf4eb68c" class="outline-4">
<h4 id="orgf4eb68c">T4 UEF Fatboy</h4>
<div class="outline-text-4" id="text-orgf4eb68c">
<ul class="org-ul">
<li>MaintenanceCostEnergyPerSecond: 400 -&gt; 950</li>
</ul>
</div>
</div>
<div id="outline-container-org26f160c" class="outline-4">
<h4 id="org26f160c">T4 UEF Mayhem</h4>
<div class="outline-text-4" id="text-org26f160c">
<ul class="org-ul">
<li>RegenRate: 40 -&gt; 15</li>
<li>Radar Radius: 96 -&gt; 64</li>
<li>Sonar Radius: 60 -&gt; 64</li>
<li>Omni Radar Removed</li>
</ul>
</div>
</div>
<div id="outline-container-org356d8be" class="outline-4">
<h4 id="org356d8be">T4 UEF Bloodasp</h4>
<div class="outline-text-4" id="text-org356d8be">
<ul class="org-ul">
<li>RegenRate: 14 -&gt; 7</li>
<li>Speed: 3.0 -&gt; 2.9</li>
<li>Veterancy Kills Required Increased</li>
</ul>
</div>
</div>
<div id="outline-container-org8d7fcef" class="outline-4">
<h4 id="org8d7fcef">T4 UEF Goliath</h4>
<div class="outline-text-4" id="text-org8d7fcef">
<ul class="org-ul">
<li>RegenRate: 30 -&gt; 20</li>
<li>Radar Radius: 96 -&gt; 64</li>
<li>Max Acceleration: 2.8 -&gt; 1.6</li>
</ul>
</div>
</div>
<div id="outline-container-orgb9fef33" class="outline-4">
<h4 id="orgb9fef33">T4 Cybran Megalith</h4>
<div class="outline-text-4" id="text-orgb9fef33">
<ul class="org-ul">
<li>BuildRate: 180 -&gt; 200</li>
<li>Radar Radius: 96 -&gt; 56</li>
<li>Sonar Radius: 60 -&gt; 56</li>
<li>Max Acceleration: 2.4 -&gt; 1.2</li>
</ul>
</div>
</div>
<div id="outline-container-org1be117d" class="outline-4">
<h4 id="org1be117d">T4 Cybran Storm Strider*</h4>
<div class="outline-text-4" id="text-org1be117d">
<ul class="org-ul">
<li>Anti Air Damage: 48 -&gt; 24 (Had 480 DPS in AA but now</li>
</ul>
<p>
has 240)
</p>
<ul class="org-ul">
<li>Unit Cap: 8 -&gt; 10</li>
<li>Rader Radius: 96 -&gt; 56</li>
<li>Stealth Removed</li>
</ul>
</div>
</div>
<div id="outline-container-orgc7d3cab" class="outline-4">
<h4 id="orgc7d3cab">T4 Cybran Megaroach</h4>
<div class="outline-text-4" id="text-orgc7d3cab">
<ul class="org-ul">
<li>Anti Air Damage: 50 -&gt; 25 (Had 800 DPS</li>
</ul>
<p>
in AA but now has 400)
</p>
<ul class="org-ul">
<li>RegenRate: 48 -&gt; 24</li>
<li>Omni Radar Removed</li>
<li>Stealth Removed</li>
<li>Radar Radius: 96 -&gt; 56</li>
</ul>
</div>
</div>
<div id="outline-container-orgdf1d653" class="outline-4">
<h4 id="orgdf1d653">T4 Cybran Madbolo</h4>
<div class="outline-text-4" id="text-orgdf1d653">
<ul class="org-ul">
<li>Fixed Rate Of Rate</li>
<li>Rocket Barrage Damage: 375 -&gt; 300</li>
</ul>
</div>
</div>
<div id="outline-container-org0b92067" class="outline-4">
<h4 id="org0b92067">T4 Cybran Basilisk</h4>
<div class="outline-text-4" id="text-org0b92067">
<ul class="org-ul">
<li>Unit Cap: 7 -&gt; 12</li>
<li><b>Anti Air</b>
<code>This Unit now had 2.2k DPS in AA but now has 600 DPS in AA</code></li>
<li>DoT Pulse: 5 -&gt; 3</li>
<li>MuzzleSalvoSize: 6 -&gt; 4</li>
<li>Rate of Fire: 0.6 -&gt; 0.5</li>
</ul>
</div>
</div>
<div id="outline-container-orgfce11cb" class="outline-4">
<h4 id="orgfce11cb">T4 Cybran Avalanche</h4>
<div class="outline-text-4" id="text-orgfce11cb">
<ul class="org-ul">
<li>Max Speed: 2.4 -&gt; 1.8 (This thing was as fast as a</li>
</ul>
<p>
Basilisk for context)
</p>
<ul class="org-ul">
<li>Radar Radius: 96 -&gt; 56</li>
<li>RegenRate: 40 -&gt; 20</li>
</ul>
</div>
</div>
<div id="outline-container-org706b00a" class="outline-4">
<h4 id="org706b00a">T4 Seraphim Yenah-lao</h4>
<div class="outline-text-4" id="text-org706b00a">
<ul class="org-ul">
<li>Max Speed: 3.0 -&gt; 2.6</li>
<li>Regen Rate: 15 -&gt; 10</li>
<li>Stealth Removed</li>
</ul>
</div>
</div>
<div id="outline-container-org72f2f1e" class="outline-4">
<h4 id="org72f2f1e">T4 Seraphim Tha-Yath</h4>
<div class="outline-text-4" id="text-org72f2f1e">
<ul class="org-ul">
<li>Cost Mass: 10000 -&gt; 12500</li>
<li>Cost Energy: 80000 -&gt; 90000</li>
<li>Max Speed: 3.3 -&gt; 3.0</li>
<li>Stealth Removed</li>
<li>Free Intel Removed <b>Anti Air</b></li>
<li>Anti Air Damage: 72 -&gt; 102</li>
<li>DamageRadius: 2.4 -&gt; 4</li>
<li>Max Radius: 40 -&gt; 60</li>
</ul>
</div>
</div>
<div id="outline-container-orgdb0ce5f" class="outline-4">
<h4 id="orgdb0ce5f">T4 Seraphim Athusil</h4>
<div class="outline-text-4" id="text-orgdb0ce5f">
<ul class="org-ul">
<li>Max Speed: 2.9 -&gt; 2.6</li>
<li>Regen Rate: 20 -&gt; 10</li>
<li>Radar Removed</li>
<li>Stealth Removed</li>
</ul>
</div>
</div>
<div id="outline-container-org773d4b9" class="outline-4">
<h4 id="org773d4b9">T4 Seraphim Thaez-Atha</h4>
<div class="outline-text-4" id="text-org773d4b9">
<ul class="org-ul">
<li>MaintenanceCostEnergyPerSecond: 900 -&gt; 2150 (Due to Stealth Field &amp; Personal Stealth)</li>
<li>Radar Radius: 96 -&gt; 64</li>
<li>Omni Removed</li>
</ul>
</div>
</div>
<div id="outline-container-org6256ec5" class="outline-4">
<h4 id="org6256ec5">T4 Seraphim Yath-Us</h4>
<div class="outline-text-4" id="text-org6256ec5">
<ul class="org-ul">
<li>Max Speed: 3.4 -&gt; 3.0</li>
<li>Stealth Removed</li>
</ul>
</div>
</div>
<div id="outline-container-orgfe8f86c" class="outline-4">
<h4 id="orgfe8f86c">T4 Seraphim Yenzotha</h4>
<div class="outline-text-4" id="text-orgfe8f86c">
<ul class="org-ul">
<li>Max Speed: 3.3 -&gt; 3.0</li>
<li>Max Acceleration: 1.0 -&gt; 1.5</li>
</ul>
</div>
</div>
<div id="outline-container-org4084e73" class="outline-4">
<h4 id="org4084e73">T4 Seraphim Seth Ilhaas</h4>
<div class="outline-text-4" id="text-org4084e73">
<ul class="org-ul">
<li>Radar Radius: 64 -&gt; 56</li>
<li>Max Speed: 3.4 -&gt; 3.0</li>
<li>Max Acceleration: 1.0 -&gt; 1.5</li>
</ul>
</div>
</div>
<div id="outline-container-orge72fab3" class="outline-4">
<h4 id="orge72fab3">T4 Seraphim Ythotha</h4>
<div class="outline-text-4" id="text-orge72fab3">
<ul class="org-ul">
<li>Max Speed: 2.6 -&gt; 2.4</li>
<li>Max Acceleration: 1.6 -&gt; 1.2</li>
<li>Regen Rate: 20 -&gt; 10</li>
</ul>
</div>
</div>
<div id="outline-container-org05fd792" class="outline-4">
<h4 id="org05fd792">T4 Aeon Inquisitor</h4>
<div class="outline-text-4" id="text-org05fd792">
<ul class="org-ul">
<li>Max Acceleration: 0.35 -&gt; 1.3</li>
<li>Radar Added (56 Radius)</li>
<li>Stealth Removed</li>
</ul>
</div>
</div>
<div id="outline-container-org1281d98" class="outline-4">
<h4 id="org1281d98">T4 Aeon Genesis</h4>
<div class="outline-text-4" id="text-org1281d98">
<ul class="org-ul">
<li>Cost Mass: 19000 -&gt; 26000</li>
<li>Cost Energy: 385000 -&gt; 435000</li>
<li>Max Speed: 3.3 -&gt; 2.6</li>
<li>Max Acceleration: 1.1 -&gt; 1.3</li>
</ul>
</div>
</div>
<div id="outline-container-org35ad7d2" class="outline-4">
<h4 id="org35ad7d2">T4 Aeon Interrogater</h4>
<div class="outline-text-4" id="text-org35ad7d2">
<ul class="org-ul">
<li>Stealth Removed</li>
</ul>
</div>
</div>
<div id="outline-container-org49b7474" class="outline-4">
<h4 id="org49b7474">T4 Aeon Elias</h4>
<div class="outline-text-4" id="text-org49b7474">
<ul class="org-ul">
<li>Unit Cap: 4 -&gt; 6</li>
<li>Max Speed: 2.9 -&gt; 2.6</li>
</ul>
</div>
</div>
<div id="outline-container-org390163c" class="outline-4">
<h4 id="org390163c">T4 Aeon Absolution</h4>
<div class="outline-text-4" id="text-org390163c">
<ul class="org-ul">
<li>Max Health: 36000 -&gt; 23000</li>
<li>Regen Rate: 12 -&gt; 6</li>
</ul>
</div>
</div>
<div id="outline-container-orgb128618" class="outline-4">
<h4 id="orgb128618">T3 Cybran Operative</h4>
<div class="outline-text-4" id="text-orgb128618">
<ul class="org-ul">
<li>Unit Cap: 1 -&gt; 3</li>
<li>MaintenanceCostEnergyPerSecond: 150 -&gt; 465</li>
<li>RadarStealthFieldRadius: 28 -&gt; 24</li>
</ul>
</div>
</div>
<div id="outline-container-orga9a743b" class="outline-4">
<h4 id="orga9a743b">T2 Cybran Deceiver</h4>
<div class="outline-text-4" id="text-orga9a743b">
<ul class="org-ul">
<li>Unit Cap: 1 -&gt; 2</li>
<li>MaintenanceCostEnergyPerSecond: 40 -&gt; 190</li>
<li>RadarStealthFieldRadius: 20 -&gt; 16</li>
</ul>
</div>
</div>
<div id="outline-container-orgbfd3e8a" class="outline-4">
<h4 id="orgbfd3e8a">T2 Cybran Hoptile</h4>
<div class="outline-text-4" id="text-orgbfd3e8a">
<ul class="org-ul">
<li>FiringRandomnessWhileMoving: 0.2 -&gt; 0.45</li>
<li>Max Radius: 37 -&gt; 36</li>
</ul>
</div>
</div>
<div id="outline-container-org568bb0e" class="outline-4">
<h4 id="org568bb0e">T2 Cybran Hippo</h4>
<div class="outline-text-4" id="text-org568bb0e">
<ul class="org-ul">
<li>Damage Radius: 1.42 -&gt; 1.25</li>
<li>Damage: 25 -&gt; 20</li>
</ul>
</div>
</div>
<div id="outline-container-org4df0c70" class="outline-4">
<h4 id="org4df0c70">T3 Cybran Hailfire</h4>
<div class="outline-text-4" id="text-org4df0c70">
<ul class="org-ul">
<li>FiringRandomnessWhileMoving: 0.5 -&gt; 1.25</li>
</ul>
</div>
</div>
<div id="outline-container-org0acfad9" class="outline-4">
<h4 id="org0acfad9">T3 Cybran Triseptitron</h4>
<div class="outline-text-4" id="text-org0acfad9">
<ul class="org-ul">
<li>Damage: 215 -&gt; 185</li>
<li>Damage Radius: 2.5 -&gt; 2.25</li>
<li>Added FiringRandomnessWhileMoving: 5.5</li>
</ul>
</div>
</div>
<div id="outline-container-orgb96865d" class="outline-4">
<h4 id="orgb96865d">T3 Cybran Mastodon</h4>
<div class="outline-text-4" id="text-orgb96865d">
<ul class="org-ul">
<li>FiringRandomnessWhileMoving: 0 -&gt; 1.5</li>
<li>Damage: 55 -&gt; 35</li>
</ul>
</div>
</div>
<div id="outline-container-org8923690" class="outline-4">
<h4 id="org8923690">T2 UEF Mongoose</h4>
<div class="outline-text-4" id="text-org8923690">
<ul class="org-ul">
<li>Damage: 15 -&gt; 12 (Gatling Gun)</li>
</ul>
</div>
</div>
</div>
</div>
