changelog/changelog.org
*** General Changes
- Removed T2 Aeon Gunship Abolisher
- Fix Seraphim T3 Flak only firing 1 projectile (doing half damage)
  instead of 2 projectiles

**** T3 Cybran Trilobyte
  - Damage: 55 -> 48
  - Health: 2500 -> 1800
  - Muzzle Velocity: 88 -> 60
  - Muzzle Velocity Randomness: 5 -> 0
  - TurretYawSpeed: 115 -> 180
  - Radar Radius: 72 -> 52
  - Max Speed: 2.9 -> 2.6
  - Energy Maintenance: 0 -> 80

**** T3 Aeon Vindicator
  - *Shield Upgrade*
    - Shield Recharge Time: 28 -> 38
    - Shield Size: 16 -> 14
    - Buildtime: 1000 -> 1250
    - Cost Mass: 285 -> 355
    - Cost Energy: 2850 -> 4150
  - Damage: (Serpentine Missile) 75 -> 50

** 1.82
- 2025-01-04
*** General Changes
- *ACU Rework*
  - All ACU Upgrades have been completely reworked to be more consistent
    with the rest of the game. Specifically, the ACUs should Engineering
    should be more inline when tech is becoming available (i.e
    Engineering Upgrades are available earlier). ACU Weapons are pushed
    back towards Late T2 & Early T3 into Late T4. You will no longer be
    able to easily rush ACU Weapon & Shield Upgrades to shut down T1
    Aggression.
    
  - Bubble Shield Upgrade receives a significant nerf to it's recharge
    time from 14 to 28 seconds.
  - https://docs.google.com/spreadsheets/d/13l-XlQKuCe39zEOENO-_f-EQvyrGwvsc-o7CVcyXe2k/edit?usp=sharing
    , This link provides a visual representation of the changes to the
    ACU upgrades.
  - All ACUs have had their health significantly decreased by a measure
    of generally 9 - 10k depending on race.
  - All ACUs Overcharge Energy Required from 4500 -> 7500 (To be
    activated in-general i.e can't overcharge at all unless you have
    7500 energy or more)

**** T2 Aeon Hover Tank*
  - Health: 1000 -> 750
  - Mass Cost: 220 -> 260
  - Energy Cost: 2150 -> 2400
  - Vision: 20 -> 18

**** T3 UEF Juggernaut*
  - Mass Cost: 3250 -> 3125
  - Energy Cost: 36000 -> 31500

**** T3 Cybran Dervish*
  - Mass Cost: 3100 -> 3250
  - Energy Cost: 33500 -> 36000
  - MaxAcceleration: 2.2 -> 1.2 (Matches all other T3.5)

**** T3 Seraphim Thaam-Thuum*
  - Mass Cost: 3100 -> 3300
  - Energy Cost: 31500 -> 36000

**** T1 Static Anti Air*
  - Health: 1400 -> 800
  - Weapon Firing between all factions has been diversified (meaning
    they all have bit different DPS and Stats)
  - Weapon Damage was significantly reduced in exchange for mobility
  - TurretYawRate: 90 -> 180
  - TurretPitchRate: 60 -> 45
  - TurretYawRange: 360 -> 180
  - Mass Cost: 200 -> 150
  - Energy Cost: 2000 -> 1500
  - Fix Target Priorities so they are actuall targetting the right units
    (i.e bombers, gunships, transports, then fighters)

** 1.81
- 2025-01-02
*** General Changes
**** Terrain Shader Improvements (Better Graphics)

The new, better way of calculating the water absorption is now available for all
terrain shaders. The only requirement is that the light multiplier is set to
more than 2.1.

Decals now use PBR light calculations if the terrain shader uses it, making them
more consistent with the ground they are on.

**** Massive Performance Optimizations (Bigger Games)

***** Class Optimization
(Credits to FAF for this amazing work!)

Significant Performance Optimizations have been done to the Class.lua. We
properly pre-allocate the table for units, shields, weapons, projectiles, damage
instances, effects, decals and all the other parts of this game.

We now properly pre-allocate them all, drastically reducing the frequency at
which the engine ends up calling the resize function.

*Throughout the entire game you can expect 10% to 30% more performance on
average, depending on what is happening.*

***** Entity Effects Optimization
Entity Effects have been converted to DummyProjectiles meaning that the engine
no longer has to caculate additional physics and more for them. This is
essential and saves a lot of performance specifically when lots of reclaim is on
the map and there are a lot of explosion effects/units being destroyed.

**** Enhanced Target Priorities (Smarter Targeting)

Introduce Enhanced Target Priorities allowing units like Snipers, Artillery, and
etc to have more complex and specific targets.

Massive work has been done to reintroduced Tier'd Targetting to ensure units are
NOT just targeting the first unit they see, but are targetting the *best*
targets available. This is a huge improvement to the game, allowing for the
player to focus less on micro-management and more on macro-management.


*** Balance Changes
**** T3 Snipers
    - T3 Snipers now cost an average of around 50% more energy to
      produce.
    - T3 Snipers do significantly less damage to Shields around (50%
      Less)
    - T3 Snipers now have a 250 E Upkeep
    - T3 Snipers Ability Tooltips have been updated
    - T3 Snipers no longer have stealth
    - T3 Snipers Health Reduced by 100

**** T2 Snipers
    - T2 Snipers do significantly less damage to Shields around (50%
      Less)

**** T2 Gunships
    - T2 Gunships TurretYawSpeed has been increased 90 from 60
    - T2 Gunships TurretYawRange has been increased from 90 to 180
    - T2 Gunships health has been reduced by 400 around the board (not
      accounting for factional diversity)

**** T4 Seraphim Bomber
    - T4 Seraphim Bomber Rate of Fire is fixed and now properly can
      release the bomb on time

**** Radar & Sonar Buildings
    - T1 and T2 Radars receive a 10% Radar Radius Increase
    - T3 Omni receives a 60% Radar Radius Increase & 30% Omni Radius
      Increase
    - T3 Omni receives an extra 1000 E Upkeep
    - T3 Omni ReactivateTime decreased from 12 to 6
    - Sonar Receives all same changes as above but T3 Sonar goes from
      500 E Upkeep to 750 E Upkeep

** 1.80
- 2024-12-31
