changelog/changelog.html

<div id="outline-container-org23b337d" class="outline-2">
<h2 id="org23b337d">1.83</h2>
<div class="outline-text-2" id="text-org23b337d">
<ul class="org-ul">
<li>2025-01-05</li>
</ul>
</div>
<div id="outline-container-org93b6ac3" class="outline-3">
<h3 id="org93b6ac3">General Changes</h3>
<div class="outline-text-3" id="text-org93b6ac3">
<ul class="org-ul">
<li>Removed T2 Aeon Gunship Abolisher</li>
<li>Fix Seraphim T3 Flak only firing 1 projectile (doing half damage)
instead of 2 projectiles</li>
</ul>
</div>

<div id="outline-container-orga59087a" class="outline-4">
<h4 id="orga59087a">T3 Cybran Trilobyte</h4>
<div class="outline-text-4" id="text-orga59087a">
<ul class="org-ul">
<li>Damage: 55 -&gt; 48</li>
<li>Health: 2500 -&gt; 1800</li>
<li>Muzzle Velocity: 88 -&gt; 60</li>
<li>Muzzle Velocity Randomness: 5 -&gt; 0</li>
<li>TurretYawSpeed: 115 -&gt; 180</li>
<li>Radar Radius: 72 -&gt; 52</li>
<li>Max Speed: 2.9 -&gt; 2.6</li>
<li>Energy Maintenance: 0 -&gt; 80</li>
</ul>
</div>
</div>

<div id="outline-container-org5c1600e" class="outline-4">
<h4 id="org5c1600e">T3 Aeon Vindicator</h4>
<div class="outline-text-4" id="text-org5c1600e">
<ul class="org-ul">
<li><b>Shield Upgrade</b>
<ul class="org-ul">
<li>Shield Recharge Time: 28 -&gt; 38</li>
<li>Shield Size: 16 -&gt; 14</li>
<li>Buildtime: 1000 -&gt; 1250</li>
<li>Cost Mass: 285 -&gt; 355</li>
<li>Cost Energy: 2850 -&gt; 4150</li>
</ul></li>
<li>Damage: (Serpentine Missile) 75 -&gt; 50</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org6ca8eb5" class="outline-2">
<h2 id="org6ca8eb5">1.82</h2>
<div class="outline-text-2" id="text-org6ca8eb5">
<ul class="org-ul">
<li>2025-01-04</li>
</ul>
</div>
<div id="outline-container-org8ceda9f" class="outline-3">
<h3 id="org8ceda9f">General Changes</h3>
<div class="outline-text-3" id="text-org8ceda9f">
<ul class="org-ul">
<li><b>ACU Rework</b>
<ul class="org-ul">
<li>All ACU Upgrades have been completely reworked to be more consistent
with the rest of the game. Specifically, the ACUs should Engineering
should be more inline when tech is becoming available (i.e
Engineering Upgrades are available earlier). ACU Weapons are pushed
back towards Late T2 &amp; Early T3 into Late T4. You will no longer be
able to easily rush ACU Weapon &amp; Shield Upgrades to shut down T1
Aggression.</li>

<li>Bubble Shield Upgrade receives a significant nerf to it's recharge
time from 14 to 28 seconds.</li>
<li><a href="https://docs.google.com/spreadsheets/d/13l-XlQKuCe39zEOENO-_f-EQvyrGwvsc-o7CVcyXe2k/edit?usp=sharing">https://docs.google.com/spreadsheets/d/13l-XlQKuCe39zEOENO-_f-EQvyrGwvsc-o7CVcyXe2k/edit?usp=sharing</a>
, This link provides a visual representation of the changes to the
ACU upgrades.</li>
<li>All ACUs have had their health significantly decreased by a measure
of generally 9 - 10k depending on race.</li>
<li>All ACUs Overcharge Energy Required from 4500 -&gt; 7500 (To be
activated in-general i.e can't overcharge at all unless you have
7500 energy or more)</li>
</ul></li>
</ul>
</div>

<div id="outline-container-org9e78f71" class="outline-4">
<h4 id="org9e78f71">T2 Aeon Hover Tank*</h4>
<div class="outline-text-4" id="text-org9e78f71">
<ul class="org-ul">
<li>Health: 1000 -&gt; 750</li>
<li>Mass Cost: 220 -&gt; 260</li>
<li>Energy Cost: 2150 -&gt; 2400</li>
<li>Vision: 20 -&gt; 18</li>
</ul>
</div>
</div>

<div id="outline-container-org0654f62" class="outline-4">
<h4 id="org0654f62">T3 UEF Juggernaut*</h4>
<div class="outline-text-4" id="text-org0654f62">
<ul class="org-ul">
<li>Mass Cost: 3250 -&gt; 3125</li>
<li>Energy Cost: 36000 -&gt; 31500</li>
</ul>
</div>
</div>

<div id="outline-container-org445af60" class="outline-4">
<h4 id="org445af60">T3 Cybran Dervish*</h4>
<div class="outline-text-4" id="text-org445af60">
<ul class="org-ul">
<li>Mass Cost: 3100 -&gt; 3250</li>
<li>Energy Cost: 33500 -&gt; 36000</li>
<li>MaxAcceleration: 2.2 -&gt; 1.2 (Matches all other T3.5)</li>
</ul>
</div>
</div>

<div id="outline-container-org29967d5" class="outline-4">
<h4 id="org29967d5">T3 Seraphim Thaam-Thuum*</h4>
<div class="outline-text-4" id="text-org29967d5">
<ul class="org-ul">
<li>Mass Cost: 3100 -&gt; 3300</li>
<li>Energy Cost: 31500 -&gt; 36000</li>
</ul>
</div>
</div>

<div id="outline-container-org975423d" class="outline-4">
<h4 id="org975423d">T1 Static Anti Air*</h4>
<div class="outline-text-4" id="text-org975423d">
<ul class="org-ul">
<li>Health: 1400 -&gt; 800</li>
<li>Weapon Firing between all factions has been diversified (meaning
they all have bit different DPS and Stats)</li>
<li>Weapon Damage was significantly reduced in exchange for mobility</li>
<li>TurretYawRate: 90 -&gt; 180</li>
<li>TurretPitchRate: 60 -&gt; 45</li>
<li>TurretYawRange: 360 -&gt; 180</li>
<li>Mass Cost: 200 -&gt; 150</li>
<li>Energy Cost: 2000 -&gt; 1500</li>
<li>Fix Target Priorities so they are actuall targetting the right units
(i.e bombers, gunships, transports, then fighters)</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org1d40b83" class="outline-2">
<h2 id="org1d40b83">1.81</h2>
<div class="outline-text-2" id="text-org1d40b83">
<ul class="org-ul">
<li>2025-01-02</li>
</ul>
</div>
<div id="outline-container-org5fd8548" class="outline-3">
<h3 id="org5fd8548">General Changes</h3>
<div class="outline-text-3" id="text-org5fd8548">
</div>
<div id="outline-container-org184c63a" class="outline-4">
<h4 id="org184c63a">Terrain Shader Improvements (Better Graphics)</h4>
<div class="outline-text-4" id="text-org184c63a">
<p>
The new, better way of calculating the water absorption is now available for all
terrain shaders. The only requirement is that the light multiplier is set to
more than 2.1.
</p>

<p>
Decals now use PBR light calculations if the terrain shader uses it, making them
more consistent with the ground they are on.
</p>
</div>
</div>

<div id="outline-container-org8d4ae15" class="outline-4">
<h4 id="org8d4ae15">Massive Performance Optimizations (Bigger Games)</h4>
<div class="outline-text-4" id="text-org8d4ae15">
</div>
<ul class="org-ul">
<li><a id="org2112540"></a>Class Optimization<br />
<div class="outline-text-5" id="text-org2112540">
<p>
(Credits to FAF for this amazing work!)
</p>

<p>
Significant Performance Optimizations have been done to the Class.lua. We
properly pre-allocate the table for units, shields, weapons, projectiles, damage
instances, effects, decals and all the other parts of this game.
</p>

<p>
We now properly pre-allocate them all, drastically reducing the frequency at
which the engine ends up calling the resize function.
</p>

<p>
<b>Throughout the entire game you can expect 10% to 30% more performance on
average, depending on what is happening.</b>
</p>
</div>
</li>

<li><a id="orgaa13dd9"></a>Entity Effects Optimization<br />
<div class="outline-text-5" id="text-orgaa13dd9">
<p>
Entity Effects have been converted to DummyProjectiles meaning that the engine
no longer has to caculate additional physics and more for them. This is
essential and saves a lot of performance specifically when lots of reclaim is on
the map and there are a lot of explosion effects/units being destroyed.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org199de3f" class="outline-4">
<h4 id="org199de3f">Enhanced Target Priorities (Smarter Targeting)</h4>
<div class="outline-text-4" id="text-org199de3f">
<p>
Introduce Enhanced Target Priorities allowing units like Snipers, Artillery, and
etc to have more complex and specific targets.
</p>

<p>
Massive work has been done to reintroduced Tier'd Targetting to ensure units are
NOT just targeting the first unit they see, but are targetting the <b>best</b>
targets available. This is a huge improvement to the game, allowing for the
player to focus less on micro-management and more on macro-management.
</p>
</div>
</div>
</div>


<div id="outline-container-org2372c5a" class="outline-3">
<h3 id="org2372c5a">Balance Changes</h3>
<div class="outline-text-3" id="text-org2372c5a">
</div>
<div id="outline-container-orgf29edb6" class="outline-4">
<h4 id="orgf29edb6">T3 Snipers</h4>
<div class="outline-text-4" id="text-orgf29edb6">
<ul class="org-ul">
<li>T3 Snipers now cost an average of around 50% more energy to
produce.</li>
<li>T3 Snipers do significantly less damage to Shields around (50%
Less)</li>
<li>T3 Snipers now have a 250 E Upkeep</li>
<li>T3 Snipers Ability Tooltips have been updated</li>
<li>T3 Snipers no longer have stealth</li>
<li>T3 Snipers Health Reduced by 100</li>
</ul>
</div>
</div>

<div id="outline-container-orge3e4a11" class="outline-4">
<h4 id="orge3e4a11">T2 Snipers</h4>
<div class="outline-text-4" id="text-orge3e4a11">
<ul class="org-ul">
<li>T2 Snipers do significantly less damage to Shields around (50%
Less)</li>
</ul>
</div>
</div>

<div id="outline-container-org6670718" class="outline-4">
<h4 id="org6670718">T2 Gunships</h4>
<div class="outline-text-4" id="text-org6670718">
<ul class="org-ul">
<li>T2 Gunships TurretYawSpeed has been increased 90 from 60</li>
<li>T2 Gunships TurretYawRange has been increased from 90 to 180</li>
<li>T2 Gunships health has been reduced by 400 around the board (not
accounting for factional diversity)</li>
</ul>
</div>
</div>

<div id="outline-container-orgedaeb34" class="outline-4">
<h4 id="orgedaeb34">T4 Seraphim Bomber</h4>
<div class="outline-text-4" id="text-orgedaeb34">
<ul class="org-ul">
<li>T4 Seraphim Bomber Rate of Fire is fixed and now properly can
release the bomb on time</li>
</ul>
</div>
</div>

<div id="outline-container-orgaf40de2" class="outline-4">
<h4 id="orgaf40de2">Radar &amp; Sonar Buildings</h4>
<div class="outline-text-4" id="text-orgaf40de2">
<ul class="org-ul">
<li>T1 and T2 Radars receive a 10% Radar Radius Increase</li>
<li>T3 Omni receives a 60% Radar Radius Increase &amp; 30% Omni Radius
Increase</li>
<li>T3 Omni receives an extra 1000 E Upkeep</li>
<li>T3 Omni ReactivateTime decreased from 12 to 6</li>
<li>Sonar Receives all same changes as above but T3 Sonar goes from
500 E Upkeep to 750 E Upkeep</li>
</ul>
</div>
</div>
</div>
</div>
