changelog/changelog.org
*** General Changes
  - Fix Shield.lua Shield Impact Effects not being applied properly.
  - Moved 3 Functions to Base Repo to better Support M28 AI

*** Balance Changes
**** T4 Aeon Absolution
    - Damage Radius 3.5 -> 6
    - Damage increased from 10% Bonus Against Shields to 50% Bonus
      Against Shields
    - TurretYawSpeed 22 -> 90
    - FiringRandomness 0.18 -> 0.1
    - FiringRandomnessWhileMoving 0.48 -> 0.3
    - Fixed The Rate of Fire causing the unit to miss it's OnFire()
      event

** 1.79
- 2024-12-30

*** General Changes
- *General Changes*

  - Fix Shield.lua Personal Shields initializing legacy code instead of
    the New Shield.lua Code
  - Fix Shield.lua not carrying default values resulting in some Nil
    Values
  - Shield.lua now applies to all Shield Types (Personal, Bubble, and
    etc) meaning that Personal Shields now interact correctly with AoE
    Weapons not allowing AoE to damage the base Health of the Unit. The
    Shield is now treated as an additional health layer to the Unit and
    no longer carries it's own collision sphere/box. Damage that
    overkills the shield now applies onto the base health of the unit.
  - Fix Multiple Units with Rate Of Fire Errors (many having too short
    of Rate of Fires)

** 1.77
- 2024-12-29
*** General Changes
- *General Changes*

  - Fix Shield.lua ShieldTypes not being passed right
  - Fix Shield.lua ALL Units with Personal Shields have AOE Pass through
    the Shields if they did have not special code that prevented it. (No
    more extra code !!!)
  - Fix Shield.lua not passing self.Size correctly for Personal Shields
    units resulting in invisible Nil Values
  - Fix Shield.lua not passing IsOn and Enabled Values correctly for
    Shields

**** T3 Cybran Cruiser*

  - T3 Cybran Cruiser Health from 22500 to 20500
  - T3 Cybran Cruiser RoF Fixed so it does not trigger OnFire() Events
    when it should not
  - T3 Cybran Cruiser 6700M & 55000E to 6950M & 64500E
  - T3 Cybran Cruiser AA DamageRadius from 0 to 1

**** T3 Cybran Battleship*

  - T3 Cybran Battleship AA Muzzles are now fixed so they work

**** T3 Cybran Submarine*

  - T3 Cybran Submarine RoF Fixed so it does not trigger OnFire() Events
    when it should not

** 1.76
- 2024-12-28
*** General Changes

- *General Changes*

  - Fix OnEnterState erroring due to bad data
  - Fix 3 Units having RoF Errors meaning their weapons were triggering
    in-correct OnFire() events

**** T3 UEF TMD*

  - T3 UEF TMD TurretYawSpeed from 62 to 280
  - T3 UEF TMD RoF from 10/10 to 20/10

- *UEF ACU Tactical Nuke*

  - Fix Nuke Silo not emptying when Nuke is fired

**** T3.5 Cybran Gunship*

  - T3.5 Cybran Gunship minimum speed from 13 to 6
  - T3.5 Cybran Gunship maximum speed from 15 to 14
  - T3.5 Cybran Gunship turnrate from 1 to 0.4

** 1.75
- 2024-12-27
*** General Changes

*** Changelog Comments:

- =AA=: Mobile AA is nerfed in Muzzle Velocity due to it's ability to
  hit high fast flying targets unintentionally. This has been corrected,
  and it can now no longer tear apart T3 & T2 Bombers/Fighters, but
  should still work against Gunships.
  
- =SAMs/Flak=: SAMs & Flak have been diversified to encourage players to
  build them versus different options. Flak is intented to be used
  versus Gunships. SAMs are intended to be used versus Fighters &
  Bombers. Damage on Both Flak & SAMs has been increased to counter T3
  Gunships/Bombers a bit better. Seraphim SAM should perform
  significantly better and not miss. SAMs lost a good bit of their HP
  while Flak gained HP (Cybran is excluded due to their high regen, they
  have gained).

**** T1 Mobile AA*

  - T1 Mobile AA (UEF, Seraphim, Aeon)receives a -15 Muzzle Velocity
  - T1 Mobile AA (Cybran) receives a +5 Muzzle Velocity

**** T2 Seraphim Cruiser*

  - T2 Seraphim Cruiser was firing with only one Muzzle, reducing it's
    DPS by 50%. This has been corrected, it will now fire with both
    Muzzles.

**** T2 Aeon Submarine*

  - T2 Aeon Submarine receives advancedTracking allowing its torpedos to
    redirect to different targets if the original target is destroyed.

**** T3 SAM*

  - All SAM HP Reduced by 500 HP (Cybran Reduced by 800 HP)
  - All SAM FiringTolerance from 12 to 1 ===
  - T3 SAM =(Aeon)= Cost from 902M & 9872E to 1100M & 11000E
  - TurretYawSpeed to 180 from 60
  - Damage from 220 to 260 ===
  - T3 SAM =(UEF)= Cost from 950M & 10000E to 1150M & 10500E
  - TurretYawSpeed to 180 from 60
  - Damage from 125 to 185 ===
  - T3 SAM =(Cybran)= Cost from 950M & 10000E to 1050M & 13000E
  - TurretYawSpeed to 180 from 60
  - Damage from 220 to 260 ===
  - T3 SAM =(Seraphim)= Cost from 950M & 10000E to 1100M & 11500E
  - TurretYawSpeed to 180 from 88
  - Damage from 55 to 280
  - RoF from 4 to 2
  - Fixed Seraphim SAM missing due to extremely high RoF

**** T3 Flak*

  - Flak HP Increased by 1200 HP (Cybran Reduced by 400 HP) ===
  - T3 Flak =(Aeon)= Cost from 1000M & 10000E to 800M & 8500E
  - TurretYawSpeed to 90 from 60
  - Damage from 120 to 160
  - DamageRadius from 4.4 to 4 ===
  - T3 Flak =(UEF)= Cost from 1000M & 10000E to 950M & 9250E
  - TurretYawSpeed to 90 from 60
  - Damage from 72 to 112
  - DamageRadius from 4.4 to 4.5 ===
  - T3 Flak =(Cybran)= Cost from 1000M & 10000E to 750M & 8000E
  - TurretYawSpeed to 90 from 80
  - Damage from 70 to 80
  - DamageRadius from 4.4 to 5 ===
  - T3 Flak =(Seraphim)= Cost from 1000M & 10000E to 825M & 8500E
  - TurretYawSpeed to 90 from 80
  - Damage from 90 to 115
  - DamageRadius from 4.4 to 4.75

** 1.74
- 2024-12-27
*** General Changes

