changelog/changelog.html

<div id="outline-container-orgbc10389" class="outline-2">
<h2 id="orgbc10389">1.80</h2>
<div class="outline-text-2" id="text-orgbc10389">
<ul class="org-ul">
<li>2024-12-31</li>
</ul>
</div>
<div id="outline-container-org6a593f7" class="outline-3">
<h3 id="org6a593f7">General Changes</h3>
<div class="outline-text-3" id="text-org6a593f7">
<ul class="org-ul">
<li>Fix Shield.lua Shield Impact Effects not being applied properly.</li>
<li>Moved 3 Functions to Base Repo to better Support M28 AI</li>
</ul>
</div>
</div>

<div id="outline-container-orgbf9b37f" class="outline-3">
<h3 id="orgbf9b37f">Balance Changes</h3>
<div class="outline-text-3" id="text-orgbf9b37f">
</div>
<div id="outline-container-org80e15cc" class="outline-4">
<h4 id="org80e15cc">T4 Aeon Absolution</h4>
<div class="outline-text-4" id="text-org80e15cc">
<ul class="org-ul">
<li>Damage Radius 3.5 -&gt; 6</li>
<li>Damage increased from 10% Bonus Against Shields to 50% Bonus
Against Shields</li>
<li>TurretYawSpeed 22 -&gt; 90</li>
<li>FiringRandomness 0.18 -&gt; 0.1</li>
<li>FiringRandomnessWhileMoving 0.48 -&gt; 0.3</li>
<li>Fixed The Rate of Fire causing the unit to miss it's OnFire()
event</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org033a10e" class="outline-2">
<h2 id="org033a10e">1.79</h2>
<div class="outline-text-2" id="text-org033a10e">
<ul class="org-ul">
<li>2024-12-30</li>
</ul>
</div>

<div id="outline-container-org601057d" class="outline-3">
<h3 id="org601057d">General Changes</h3>
<div class="outline-text-3" id="text-org601057d">
<ul class="org-ul">
<li><b>General Changes</b>

<ul class="org-ul">
<li>Fix Shield.lua Personal Shields initializing legacy code instead of
the New Shield.lua Code</li>
<li>Fix Shield.lua not carrying default values resulting in some Nil
Values</li>
<li>Shield.lua now applies to all Shield Types (Personal, Bubble, and
etc) meaning that Personal Shields now interact correctly with AoE
Weapons not allowing AoE to damage the base Health of the Unit. The
Shield is now treated as an additional health layer to the Unit and
no longer carries it's own collision sphere/box. Damage that
overkills the shield now applies onto the base health of the unit.</li>
<li>Fix Multiple Units with Rate Of Fire Errors (many having too short
of Rate of Fires)</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd230967" class="outline-2">
<h2 id="orgd230967">1.77</h2>
<div class="outline-text-2" id="text-orgd230967">
<ul class="org-ul">
<li>2024-12-29</li>
</ul>
</div>
<div id="outline-container-orgb89592a" class="outline-3">
<h3 id="orgb89592a">General Changes</h3>
<div class="outline-text-3" id="text-orgb89592a">
<ul class="org-ul">
<li><b>General Changes</b>

<ul class="org-ul">
<li>Fix Shield.lua ShieldTypes not being passed right</li>
<li>Fix Shield.lua ALL Units with Personal Shields have AOE Pass through
the Shields if they did have not special code that prevented it. (No
more extra code !!!)</li>
<li>Fix Shield.lua not passing self.Size correctly for Personal Shields
units resulting in invisible Nil Values</li>
<li>Fix Shield.lua not passing IsOn and Enabled Values correctly for
Shields</li>
</ul></li>
</ul>
</div>

<div id="outline-container-orgd13c34f" class="outline-4">
<h4 id="orgd13c34f">T3 Cybran Cruiser*</h4>
<div class="outline-text-4" id="text-orgd13c34f">
<ul class="org-ul">
<li>T3 Cybran Cruiser Health from 22500 to 20500</li>
<li>T3 Cybran Cruiser RoF Fixed so it does not trigger OnFire() Events
when it should not</li>
<li>T3 Cybran Cruiser 6700M &amp; 55000E to 6950M &amp; 64500E</li>
<li>T3 Cybran Cruiser AA DamageRadius from 0 to 1</li>
</ul>
</div>
</div>

<div id="outline-container-orgbc80982" class="outline-4">
<h4 id="orgbc80982">T3 Cybran Battleship*</h4>
<div class="outline-text-4" id="text-orgbc80982">
<ul class="org-ul">
<li>T3 Cybran Battleship AA Muzzles are now fixed so they work</li>
</ul>
</div>
</div>

<div id="outline-container-org275f19c" class="outline-4">
<h4 id="org275f19c">T3 Cybran Submarine*</h4>
<div class="outline-text-4" id="text-org275f19c">
<ul class="org-ul">
<li>T3 Cybran Submarine RoF Fixed so it does not trigger OnFire() Events
when it should not</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf1970b2" class="outline-2">
<h2 id="orgf1970b2">1.76</h2>
<div class="outline-text-2" id="text-orgf1970b2">
<ul class="org-ul">
<li>2024-12-28</li>
</ul>
</div>
<div id="outline-container-orge6f5e74" class="outline-3">
<h3 id="orge6f5e74">General Changes</h3>
<div class="outline-text-3" id="text-orge6f5e74">
<ul class="org-ul">
<li><b>General Changes</b>

<ul class="org-ul">
<li>Fix OnEnterState erroring due to bad data</li>
<li>Fix 3 Units having RoF Errors meaning their weapons were triggering
in-correct OnFire() events</li>
</ul></li>
</ul>
</div>

<div id="outline-container-org7c747b4" class="outline-4">
<h4 id="org7c747b4">T3 UEF TMD*</h4>
<div class="outline-text-4" id="text-org7c747b4">
<ul class="org-ul">
<li>T3 UEF TMD TurretYawSpeed from 62 to 280</li>
<li>T3 UEF TMD RoF from 10/10 to 20/10</li>
</ul>
<ul class="org-ul">
<li><b>UEF ACU Tactical Nuke</b>

<ul class="org-ul">
<li>Fix Nuke Silo not emptying when Nuke is fired</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org2b673e8" class="outline-4">
<h4 id="org2b673e8">T3.5 Cybran Gunship*</h4>
<div class="outline-text-4" id="text-org2b673e8">
<ul class="org-ul">
<li>T3.5 Cybran Gunship minimum speed from 13 to 6</li>
<li>T3.5 Cybran Gunship maximum speed from 15 to 14</li>
<li>T3.5 Cybran Gunship turnrate from 1 to 0.4</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org95193fc" class="outline-2">
<h2 id="org95193fc">1.75</h2>
<div class="outline-text-2" id="text-org95193fc">
<ul class="org-ul">
<li>2024-12-27</li>
</ul>
</div>
<div id="outline-container-orgdb4d0fb" class="outline-3">
<h3 id="orgdb4d0fb">General Changes</h3>
</div>

<div id="outline-container-org9e8145d" class="outline-3">
<h3 id="org9e8145d">Changelog Comments:</h3>
<div class="outline-text-3" id="text-org9e8145d">
<ul class="org-ul">
<li><code>AA</code>: Mobile AA is nerfed in Muzzle Velocity due to it's ability to
hit high fast flying targets unintentionally. This has been corrected,
and it can now no longer tear apart T3 &amp; T2 Bombers/Fighters, but
should still work against Gunships.</li>

<li><code>SAMs/Flak</code>: SAMs &amp; Flak have been diversified to encourage players to
build them versus different options. Flak is intented to be used
versus Gunships. SAMs are intended to be used versus Fighters &amp;
Bombers. Damage on Both Flak &amp; SAMs has been increased to counter T3
Gunships/Bombers a bit better. Seraphim SAM should perform
significantly better and not miss. SAMs lost a good bit of their HP
while Flak gained HP (Cybran is excluded due to their high regen, they
have gained).</li>
</ul>
</div>

<div id="outline-container-org5ad5057" class="outline-4">
<h4 id="org5ad5057">T1 Mobile AA*</h4>
<div class="outline-text-4" id="text-org5ad5057">
<ul class="org-ul">
<li>T1 Mobile AA (UEF, Seraphim, Aeon)receives a -15 Muzzle Velocity</li>
<li>T1 Mobile AA (Cybran) receives a +5 Muzzle Velocity</li>
</ul>
</div>
</div>

<div id="outline-container-org7cc58e4" class="outline-4">
<h4 id="org7cc58e4">T2 Seraphim Cruiser*</h4>
<div class="outline-text-4" id="text-org7cc58e4">
<ul class="org-ul">
<li>T2 Seraphim Cruiser was firing with only one Muzzle, reducing it's
DPS by 50%. This has been corrected, it will now fire with both
Muzzles.</li>
</ul>
</div>
</div>

<div id="outline-container-org360ab53" class="outline-4">
<h4 id="org360ab53">T2 Aeon Submarine*</h4>
<div class="outline-text-4" id="text-org360ab53">
<ul class="org-ul">
<li>T2 Aeon Submarine receives advancedTracking allowing its torpedos to
redirect to different targets if the original target is destroyed.</li>
</ul>
</div>
</div>

<div id="outline-container-org834232f" class="outline-4">
<h4 id="org834232f">T3 SAM*</h4>
<div class="outline-text-4" id="text-org834232f">
<ul class="org-ul">
<li>All SAM HP Reduced by 500 HP (Cybran Reduced by 800 HP)</li>
<li>All SAM FiringTolerance from 12 to 1 <code>=</code></li>
<li>T3 SAM <code>(Aeon)</code> Cost from 902M &amp; 9872E to 1100M &amp; 11000E</li>
<li>TurretYawSpeed to 180 from 60</li>
<li>Damage from 220 to 260 <code>=</code></li>
<li>T3 SAM <code>(UEF)</code> Cost from 950M &amp; 10000E to 1150M &amp; 10500E</li>
<li>TurretYawSpeed to 180 from 60</li>
<li>Damage from 125 to 185 <code>=</code></li>
<li>T3 SAM <code>(Cybran)</code> Cost from 950M &amp; 10000E to 1050M &amp; 13000E</li>
<li>TurretYawSpeed to 180 from 60</li>
<li>Damage from 220 to 260 <code>=</code></li>
<li>T3 SAM <code>(Seraphim)</code> Cost from 950M &amp; 10000E to 1100M &amp; 11500E</li>
<li>TurretYawSpeed to 180 from 88</li>
<li>Damage from 55 to 280</li>
<li>RoF from 4 to 2</li>
<li>Fixed Seraphim SAM missing due to extremely high RoF</li>
</ul>
</div>
</div>

<div id="outline-container-org8f9d483" class="outline-4">
<h4 id="org8f9d483">T3 Flak*</h4>
<div class="outline-text-4" id="text-org8f9d483">
<ul class="org-ul">
<li>Flak HP Increased by 1200 HP (Cybran Reduced by 400 HP) <code>=</code></li>
<li>T3 Flak <code>(Aeon)</code> Cost from 1000M &amp; 10000E to 800M &amp; 8500E</li>
<li>TurretYawSpeed to 90 from 60</li>
<li>Damage from 120 to 160</li>
<li>DamageRadius from 4.4 to 4 <code>=</code></li>
<li>T3 Flak <code>(UEF)</code> Cost from 1000M &amp; 10000E to 950M &amp; 9250E</li>
<li>TurretYawSpeed to 90 from 60</li>
<li>Damage from 72 to 112</li>
<li>DamageRadius from 4.4 to 4.5 <code>=</code></li>
<li>T3 Flak <code>(Cybran)</code> Cost from 1000M &amp; 10000E to 750M &amp; 8000E</li>
<li>TurretYawSpeed to 90 from 80</li>
<li>Damage from 70 to 80</li>
<li>DamageRadius from 4.4 to 5 <code>=</code></li>
<li>T3 Flak <code>(Seraphim)</code> Cost from 1000M &amp; 10000E to 825M &amp; 8500E</li>
<li>TurretYawSpeed to 90 from 80</li>
<li>Damage from 90 to 115</li>
<li>DamageRadius from 4.4 to 4.75</li>
</ul>
</div>
</div>
</div>
</div>
