changelog/changelog.org
**** T2 Cruisers*

  - Fix T2 Cruisers not being able to hit targets flying away from them.
  - Fix Seraphim T2 Cruiser having less projectiles firing then it was
    supposed to.

** 1.73
- 2024-12-25
*** T1 Sea
- =Frigate:= AA should be generally less effective and Early Game Naval
  MUST be supported by the Air and no Navy should be allowed to this Air
  Support without suffering significantly from Enemy Torpedo Bombers.
  Torpedo Defense should be much less effective and only come in as a
  stopgap method whether then a full defense method.
- =Submarines:= should not be able to fill a frontline role and should
  be subsectioned to Support Roles in formations of Battleships,
  Destroyers, and Frigates. They should be able to be used to support
  the frontline, but not BE the frontline. ### T2 Sea
- =Cruisers:= Each Faction's Cruiser serves a different purpose and
  should be able to be used to support the frontline, but not BE the
  frontline. They should have a more effective AA then Frigates & Mobile
  Hover Flak as well as any other form of AA that might not be a naval
  asset.
- =Destroyers:= Each Faction's Destroyer serves a different purpose and
  should be able to be used to as the frontline. Frigates will most
  likely continue to be used till Tech 3 Phase in which they will be
  phased out however during the Tech 2. They most likely will still see
  heavy usage. Destroyers have (receiving a -200 mass discount) should
  be able to more cost effective. They serve as a long range kiting
  force; Frigates will soak most of the damage till the Tech 3 Phase, in
  which by then Destroyers will be the main soaking force for
  Battleships.
- =Submarines:= T2 Submarines Torpedo Defense has been completely
  removed, this means they will not be able to fight other Submarines
  effectively, unless with the best micro (this is intentional).
  Submarines will be used for ambushing and killing enemy ships
  reinforcing and such to the Combat Zones (i.e imagine Seton's Clutch
  20km in a Gyle Cast) ### T3 Sea
- =Submarines:= T3 Submarines Torpedo Defense has been completely
  removed as well as their sonar stealth. These two submarines are used
  VASTLY different from T2 Submarines. The Assault Submarine (Cybran) is
  a frontline submarine (highest hp and the most numerous torpedos to
  overwhelm destroyer TD) meant to make up for their lacking battleship
  and the Seraphim Submarine is used to support via ambushing and
  flanking, it has the highest damage output of all submarines and
  fastest torpedos (but lowest hp except for T1 Submarines).
- =Battleships:= Battleships have been directly been buffed in both HP,
  Damage, and Range. They are the backbone of the Navy supported by
  their Destroyers, Submarines, and Cruisers. They are the most
  expensive unit in the Naval Area. They will be used for the frontline
  and will be the most difficult to kill.

** 1.72
- 2024-12-24
*** General Changes
- *Overrall*

  - Fix Rapid Fire Miasma Cannon Bug on Aeon ACU
  - Fix SMDs & Mobile SMDs being able to fire even with no ammo
  - Fix Commander OC needing to be double clicked on target multiple
    times
  - Fix Commander OC causing M28 to suicide
  - Fix Commander OC being classified as Countermeasure :KEKW:
    @maudlin27
  - Fix Game Crashing if EnergyRequiredPerSecond wasnt defined in the
    Blueprint
  - Fix UI Order Attack Command not even using the correct Behavior
  - Fix small bugs with UI-Side Overcharge Order

  - Moved ACU Overcharge to a unique state that allows it behavior
    without a EnergyRequiredPerSecond but a EnergyRequired (Meaning it's
    completely RoF Dependent)

** 1.71
- 2024-12-23
*** General Changes
**** T3 Torpedo Bomber*

  - All T3 TB have received a significant maneuverability increase

**** T2 Torpedo Bomber*

  - All T2 TB have received a significant maneuverability increase

**** T2 Gunship*

  - All T2 Gunships have received a significant maneuverability increase

**** T1 MAA*

  - Cost Doubled for =Energy & Mass=

** 1.70
- 2024-12-22
*** General Changes
**** T3 Air Superiority Fighter*

  - All T3 Air Superiority Fighters (ASF) have received a =100% DPS=
    increase
  - All T3 ASF have received a significant maneuverability increase
  - All T3 ASF have received a slight health increase

**** T3.5 Air Penetration Fighter*

  - All T3 Air Penetration Fighters (APF) have received a =50% DPS=
    increase
  - All T3 APF have received a significant maneuverability increase
  - All T3 APF have received a significant health increase

**** T2 Blaze*

  - T2 Blaze receives an additional =10%= Speed Reduction while in water
  - T2 Blaze =Vision & Weapon Range= has been adjusted by 4 going from
    =24 -> 20=

**** T3 Armilliary*

  - T3 Armilliary goes from =13/10 RoF to 20/10 RoF=

**** T1 Frigates*

  - T1 Aeon Frigate receives a significant nerf to it's
    =Torpedo Defense=
  - T1 Cybran Frigate receives a significant nerf to it's
    =Anti Air Defense=

** 1.69
- 2024-11-2
*** General Changes
- *Overrall*

  - Fixed Aeon T4 Overlord Death Animation
  - Fixed Nuke Launchers not completing firing cycle
  - Small Fix for Mavor
  - Moved CreateProjectileAtMuzzle to Official Repo

** 1.67
- 2024-10-31
*** General Changes

- *Overrall*
  - Fix Some Units Not Firing

** 1.67
- 2024-10-30
