changelog/changelog.html

<div id="outline-container-orgf9fd6e5" class="outline-2">
<h2 id="orgf9fd6e5">1.74</h2>
<div class="outline-text-2" id="text-orgf9fd6e5">
<ul class="org-ul">
<li>2024-12-27</li>
</ul>
</div>
<div id="outline-container-orga179220" class="outline-3">
<h3 id="orga179220">General Changes</h3>
<div class="outline-text-3" id="text-orga179220">
</div>
<div id="outline-container-orgd680c21" class="outline-4">
<h4 id="orgd680c21">T2 Cruisers*</h4>
<div class="outline-text-4" id="text-orgd680c21">
<ul class="org-ul">
<li>Fix T2 Cruisers not being able to hit targets flying away from them.</li>
<li>Fix Seraphim T2 Cruiser having less projectiles firing then it was
supposed to.</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org853403b" class="outline-2">
<h2 id="org853403b">1.73</h2>
<div class="outline-text-2" id="text-org853403b">
<ul class="org-ul">
<li>2024-12-25</li>
</ul>
</div>
<div id="outline-container-orgf58873d" class="outline-3">
<h3 id="orgf58873d">T1 Sea</h3>
<div class="outline-text-3" id="text-orgf58873d">
<ul class="org-ul">
<li><code>Frigate:</code> AA should be generally less effective and Early Game Naval
MUST be supported by the Air and no Navy should be allowed to this Air
Support without suffering significantly from Enemy Torpedo Bombers.
Torpedo Defense should be much less effective and only come in as a
stopgap method whether then a full defense method.</li>
<li><code>Submarines:</code> should not be able to fill a frontline role and should
be subsectioned to Support Roles in formations of Battleships,
Destroyers, and Frigates. They should be able to be used to support
the frontline, but not BE the frontline. ### T2 Sea</li>
<li><code>Cruisers:</code> Each Faction's Cruiser serves a different purpose and
should be able to be used to support the frontline, but not BE the
frontline. They should have a more effective AA then Frigates &amp; Mobile
Hover Flak as well as any other form of AA that might not be a naval
asset.</li>
<li><code>Destroyers:</code> Each Faction's Destroyer serves a different purpose and
should be able to be used to as the frontline. Frigates will most
likely continue to be used till Tech 3 Phase in which they will be
phased out however during the Tech 2. They most likely will still see
heavy usage. Destroyers have (receiving a -200 mass discount) should
be able to more cost effective. They serve as a long range kiting
force; Frigates will soak most of the damage till the Tech 3 Phase, in
which by then Destroyers will be the main soaking force for
Battleships.</li>
<li><code>Submarines:</code> T2 Submarines Torpedo Defense has been completely
removed, this means they will not be able to fight other Submarines
effectively, unless with the best micro (this is intentional).
Submarines will be used for ambushing and killing enemy ships
reinforcing and such to the Combat Zones (i.e imagine Seton's Clutch
20km in a Gyle Cast) ### T3 Sea</li>
<li><code>Submarines:</code> T3 Submarines Torpedo Defense has been completely
removed as well as their sonar stealth. These two submarines are used
VASTLY different from T2 Submarines. The Assault Submarine (Cybran) is
a frontline submarine (highest hp and the most numerous torpedos to
overwhelm destroyer TD) meant to make up for their lacking battleship
and the Seraphim Submarine is used to support via ambushing and
flanking, it has the highest damage output of all submarines and
fastest torpedos (but lowest hp except for T1 Submarines).</li>
<li><code>Battleships:</code> Battleships have been directly been buffed in both HP,
Damage, and Range. They are the backbone of the Navy supported by
their Destroyers, Submarines, and Cruisers. They are the most
expensive unit in the Naval Area. They will be used for the frontline
and will be the most difficult to kill.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org94602e4" class="outline-2">
<h2 id="org94602e4">1.72</h2>
<div class="outline-text-2" id="text-org94602e4">
<ul class="org-ul">
<li>2024-12-24</li>
</ul>
</div>
<div id="outline-container-org332ead1" class="outline-3">
<h3 id="org332ead1">General Changes</h3>
<div class="outline-text-3" id="text-org332ead1">
<ul class="org-ul">
<li><b>Overrall</b>

<ul class="org-ul">
<li>Fix Rapid Fire Miasma Cannon Bug on Aeon ACU</li>
<li>Fix SMDs &amp; Mobile SMDs being able to fire even with no ammo</li>
<li>Fix Commander OC needing to be double clicked on target multiple
times</li>
<li>Fix Commander OC causing M28 to suicide</li>
<li>Fix Commander OC being classified as Countermeasure :KEKW:
@maudlin27</li>
<li>Fix Game Crashing if EnergyRequiredPerSecond wasnt defined in the
Blueprint</li>
<li>Fix UI Order Attack Command not even using the correct Behavior</li>
<li>Fix small bugs with UI-Side Overcharge Order</li>

<li>Moved ACU Overcharge to a unique state that allows it behavior
without a EnergyRequiredPerSecond but a EnergyRequired (Meaning it's
completely RoF Dependent)</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org95031de" class="outline-2">
<h2 id="org95031de">1.71</h2>
<div class="outline-text-2" id="text-org95031de">
<ul class="org-ul">
<li>2024-12-23</li>
</ul>
</div>
<div id="outline-container-org2a834fb" class="outline-3">
<h3 id="org2a834fb">General Changes</h3>
<div class="outline-text-3" id="text-org2a834fb">
</div>
<div id="outline-container-orgb3abd09" class="outline-4">
<h4 id="orgb3abd09">T3 Torpedo Bomber*</h4>
<div class="outline-text-4" id="text-orgb3abd09">
<ul class="org-ul">
<li>All T3 TB have received a significant maneuverability increase</li>
</ul>
</div>
</div>

<div id="outline-container-org7213fe9" class="outline-4">
<h4 id="org7213fe9">T2 Torpedo Bomber*</h4>
<div class="outline-text-4" id="text-org7213fe9">
<ul class="org-ul">
<li>All T2 TB have received a significant maneuverability increase</li>
</ul>
</div>
</div>

<div id="outline-container-org3927b04" class="outline-4">
<h4 id="org3927b04">T2 Gunship*</h4>
<div class="outline-text-4" id="text-org3927b04">
<ul class="org-ul">
<li>All T2 Gunships have received a significant maneuverability increase</li>
</ul>
</div>
</div>

<div id="outline-container-org366e5f4" class="outline-4">
<h4 id="org366e5f4">T1 MAA*</h4>
<div class="outline-text-4" id="text-org366e5f4">
<ul class="org-ul">
<li>Cost Doubled for <code>Energy &amp; Mass</code></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org84f5e18" class="outline-2">
<h2 id="org84f5e18">1.70</h2>
<div class="outline-text-2" id="text-org84f5e18">
<ul class="org-ul">
<li>2024-12-22</li>
</ul>
</div>
<div id="outline-container-org9448fde" class="outline-3">
<h3 id="org9448fde">General Changes</h3>
<div class="outline-text-3" id="text-org9448fde">
</div>
<div id="outline-container-org8f24f22" class="outline-4">
<h4 id="org8f24f22">T3 Air Superiority Fighter*</h4>
<div class="outline-text-4" id="text-org8f24f22">
<ul class="org-ul">
<li>All T3 Air Superiority Fighters (ASF) have received a <code>100% DPS</code>
increase</li>
<li>All T3 ASF have received a significant maneuverability increase</li>
<li>All T3 ASF have received a slight health increase</li>
</ul>
</div>
</div>

<div id="outline-container-org3a0f59c" class="outline-4">
<h4 id="org3a0f59c">T3.5 Air Penetration Fighter*</h4>
<div class="outline-text-4" id="text-org3a0f59c">
<ul class="org-ul">
<li>All T3 Air Penetration Fighters (APF) have received a <code>50% DPS</code>
increase</li>
<li>All T3 APF have received a significant maneuverability increase</li>
<li>All T3 APF have received a significant health increase</li>
</ul>
</div>
</div>

<div id="outline-container-orgc311917" class="outline-4">
<h4 id="orgc311917">T2 Blaze*</h4>
<div class="outline-text-4" id="text-orgc311917">
<ul class="org-ul">
<li>T2 Blaze receives an additional <code>10%</code> Speed Reduction while in water</li>
<li>T2 Blaze <code>Vision &amp; Weapon Range</code> has been adjusted by 4 going from
<code>24 -&gt; 20</code></li>
</ul>
</div>
</div>

<div id="outline-container-org0bc109d" class="outline-4">
<h4 id="org0bc109d">T3 Armilliary*</h4>
<div class="outline-text-4" id="text-org0bc109d">
<ul class="org-ul">
<li>T3 Armilliary goes from <code>13/10 RoF to 20/10 RoF</code></li>
</ul>
</div>
</div>

<div id="outline-container-orga925bc7" class="outline-4">
<h4 id="orga925bc7">T1 Frigates*</h4>
<div class="outline-text-4" id="text-orga925bc7">
<ul class="org-ul">
<li>T1 Aeon Frigate receives a significant nerf to it's
<code>Torpedo Defense</code></li>
<li>T1 Cybran Frigate receives a significant nerf to it's
<code>Anti Air Defense</code></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org9b19b6a" class="outline-2">
<h2 id="org9b19b6a">1.69</h2>
<div class="outline-text-2" id="text-org9b19b6a">
<ul class="org-ul">
<li>2024-11-2</li>
</ul>
</div>
<div id="outline-container-org4b0d1fd" class="outline-3">
<h3 id="org4b0d1fd">General Changes</h3>
<div class="outline-text-3" id="text-org4b0d1fd">
<ul class="org-ul">
<li><b>Overrall</b>

<ul class="org-ul">
<li>Fixed Aeon T4 Overlord Death Animation</li>
<li>Fixed Nuke Launchers not completing firing cycle</li>
<li>Small Fix for Mavor</li>
<li>Moved CreateProjectileAtMuzzle to Official Repo</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgfb690f2" class="outline-2">
<h2 id="orgfb690f2">1.67</h2>
<div class="outline-text-2" id="text-orgfb690f2">
<ul class="org-ul">
<li>2024-10-31</li>
</ul>
</div>
<div id="outline-container-org8a3c307" class="outline-3">
<h3 id="org8a3c307">General Changes</h3>
<div class="outline-text-3" id="text-org8a3c307">
<ul class="org-ul">
<li><b>Overrall</b>
<ul class="org-ul">
<li>Fix Some Units Not Firing</li>
</ul></li>
</ul>
</div>
</div>
</div>
