changelog/changelog.org
*** General Changes
- *Overrall*
  - Fully Fixed Units being stuck to the ground if they had
    =bp.WeaponUnpackLocksMotion= due to them going into the ReloadState
    and never being allowed to repack.
  - Fix Various small bugs with projectiles
  - Fix BallisticAcc not always being performed when needed too
  - Fix T3 Penetrator Gunship hitting ground with Laser
  - Fix T2/T3 Factories BuildTime being extremely high for no reason

** 1.66
- 2024-10-27
*** General Changes
- *Overrall*

  - Fixed Units getting stuck in their packing/unpacking animations
    =Part 6=

**** T3 Cybran Penetrator Gunship*

  - Explanation: The Penetrator Gunship had mobility issues that
    prevented its lasers from firing consistently. Expanding the yaw and
    arc heading ranges addresses this issue, improving weapon alignment.
  - *Arc Heading Range*: Increased from =50= to =180=
  **** Turret Yaw Range*: Increased from =50= to =180=

**** T2 Fighters*

  - Explanation: T2 Fighters struggled to hit high-speed bombers and
    gunships due to their damage radius. The damage radius has been
    reverted to 0, and rate of fire increased to enhance their
    effectiveness, especially against T1 Fighters.
  - *Projectile Lifetime Multiplier*: Set to =1.5=
  - *Damage Radius*: Reverted from =2= to =0=
  - *Rate of Fire*: Increased from =20/10= to =25/10=

**** T4 Aeon Avernus*

  - Explanation: The Avernus was gaining veterancy too quickly and had a
    high regen rate at higher veterancy levels, creating balance issues.
    The kill requirements and regen rates have been adjusted to curb
    this.
  - *Veterancy Kills*: Adjusted thresholds for each level: Level1==200=,
    Level2==350=, Level3==450=, Level4==500=, Level5==650=
  - *Regen Rate*: Adjusted per level: Level1==5=, Level2==10=,
    Level3==15=, Level4==30=, Level5==60=

**** T3 Seraphim Land*

  - Explanation: The T3 Ilsatha unit underperformed for its cost,
    especially after the Otheeka's removal. A damage and muzzle velocity
    buff makes it more effective and worth its cost.
  - *Removed Otheeka*
  **** T3 Ilsatha*

    - *Damage*: Increased from =55= to =65=
    - *Muzzle Velocity*: Increased from =30= to =40=

**** T3 Cybran Land*

  - Explanation: The T3 Cybran Slink's effectiveness was too high for
    its energy upkeep and build time, leading to an imbalance. These
    changes adjust its costs and damage output to better balance its
    role as a unique T3.5 MAA unit.
  - *Removed Crawfish*
  **** T3 Slink*

    - *Damage*: Increased from =120= to =180=
    - *Energy Cost*: Increased from =12500= to =16500=
    - *Mass Cost*: Increased from =1250= to =1450=
    - *Build Time*: Increased from =41= seconds to =62= seconds
    - *Energy Maintenance* Increased from =150= to =300=

** 1.65
- 2024-10-25
*** General Changes

  - Fixed Units getting stuck in their packing/unpacking animations

*** T3 Barrage Artillery (All Factions)

  - Explanation: The T3 Barrage Artillery's rate of fire was drastically
    reduced to fix an unintended rapid fire issue, while the turret's
    yaw range and speed were corrected to stop alignment problems when
    aiming. Additionally, target acquisition was made faster for better
    responsiveness.
  - Rate of Fire: Corrected to =10/90= from =10/10=
  - Turret Yaw Range: Fixed to =180=
  - Turret Yaw Speed: Fixed to =50=
  - Target Check Interval: Lowered to =1= from =3=

*** T2 UEF Shield Boat

  - Explanation: The T2 UEF Shield Boat was rebalanced to reduce its
    durability and tweak shield mechanics, making it regenerate faster
    but start later, with a larger shield size and adjusted damage
    spillover. Its vertical offset was changed to fix issues with air
    units.
  - Shield Max Health: Reduced from =8500= to =5500=
  - Shield Energy Drain Recharge Time: Reduced from =6.2= to =5=
  - Shield Regen Rate: Increased from =55= to =80=
  - Shield Regen Start Time: Increased from =2= to =3=
  - Shield Size: Increased from =62= to =120=
  - Shield Spill Over Damage Modifier: Set to =0.50= (This was
    previously =15%= but had a special =50%= damage spillover specific
    to shield boats)
  - Shield Vertical Offset: Changed from =-15= to =-50=

*** Seraphim T2 Land

Seraphim T2 Land units struggled due to poor turn radius and muzzle velocity,
resulting in performance issues. These changes aim to address these weaknesses
by improving weapon speed and maneuverability.

Additionally, the redundant T2 Shield Protector Bot was removed.

*Removed T2 Shield Protector Bot*
**** T2 Seraphim Iltha

    - Muzzle Velocity: Increased from =30= to =35=
    - Turn Rate: Increased from =40= to =42.5=

**** T2 Seraphim Ilsavoh

    - Muzzle Velocity: Increased from =32= to =36=
    - Turn Radius: Increased from =0.5= to =2=

*** Aeon T2 Land

Aeon T2 Land was overly dependent on the T2 Aeon Sniper, making it the dominant
choice at T2. These adjustments balance the power dynamic, making other units
like Blaze and Obsidian more viable by adjusting costs, stats, and
functionality.

**** T2 Aeon Sniper
    - Build Time: Increased from =11= seconds to =47= seconds
    - Energy Cost: Increased from =5050= to =6650=
    - Mass Cost: Increased from =465= to =515=
    - Turn Rate: Increased from =44= to =50=
    - Turn Radius: Reduced from =8= to =6=
    - Max Speed: Increased from =3.6= to =3.7=

