changelog/changelog.html

<div id="outline-container-orgbd95a05" class="outline-2">
<h2 id="orgbd95a05">1.67</h2>
<div class="outline-text-2" id="text-orgbd95a05">
<ul class="org-ul">
<li>2024-10-30</li>
</ul>
</div>
<div id="outline-container-orgddf8718" class="outline-3">
<h3 id="orgddf8718">General Changes</h3>
<div class="outline-text-3" id="text-orgddf8718">
<ul class="org-ul">
<li><b>Overrall</b>
<ul class="org-ul">
<li>Fully Fixed Units being stuck to the ground if they had
<code>bp.WeaponUnpackLocksMotion</code> due to them going into the ReloadState
and never being allowed to repack.</li>
<li>Fix Various small bugs with projectiles</li>
<li>Fix BallisticAcc not always being performed when needed too</li>
<li>Fix T3 Penetrator Gunship hitting ground with Laser</li>
<li>Fix T2/T3 Factories BuildTime being extremely high for no reason</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3c3f95d" class="outline-2">
<h2 id="org3c3f95d">1.66</h2>
<div class="outline-text-2" id="text-org3c3f95d">
<ul class="org-ul">
<li>2024-10-27</li>
</ul>
</div>
<div id="outline-container-org48334e2" class="outline-3">
<h3 id="org48334e2">General Changes</h3>
<div class="outline-text-3" id="text-org48334e2">
<ul class="org-ul">
<li><b>Overrall</b>

<ul class="org-ul">
<li>Fixed Units getting stuck in their packing/unpacking animations
<code>Part 6</code></li>
</ul></li>
</ul>
</div>

<div id="outline-container-org34082fb" class="outline-4">
<h4 id="org34082fb">T3 Cybran Penetrator Gunship*</h4>
<div class="outline-text-4" id="text-org34082fb">
<ul class="org-ul">
<li>Explanation: The Penetrator Gunship had mobility issues that
prevented its lasers from firing consistently. Expanding the yaw and
arc heading ranges addresses this issue, improving weapon alignment.</li>
<li><b>Arc Heading Range</b>: Increased from <code>50</code> to <code>180</code></li>
</ul>
<p>
<b>**</b> Turret Yaw Range*: Increased from <code>50</code> to <code>180</code>
</p>
</div>
</div>

<div id="outline-container-org98bda60" class="outline-4">
<h4 id="org98bda60">T2 Fighters*</h4>
<div class="outline-text-4" id="text-org98bda60">
<ul class="org-ul">
<li>Explanation: T2 Fighters struggled to hit high-speed bombers and
gunships due to their damage radius. The damage radius has been
reverted to 0, and rate of fire increased to enhance their
effectiveness, especially against T1 Fighters.</li>
<li><b>Projectile Lifetime Multiplier</b>: Set to <code>1.5</code></li>
<li><b>Damage Radius</b>: Reverted from <code>2</code> to <code>0</code></li>
<li><b>Rate of Fire</b>: Increased from <code>20/10</code> to <code>25/10</code></li>
</ul>
</div>
</div>

<div id="outline-container-org727e394" class="outline-4">
<h4 id="org727e394">T4 Aeon Avernus*</h4>
<div class="outline-text-4" id="text-org727e394">
<ul class="org-ul">
<li>Explanation: The Avernus was gaining veterancy too quickly and had a
high regen rate at higher veterancy levels, creating balance issues.
The kill requirements and regen rates have been adjusted to curb
this.</li>
<li><b>Veterancy Kills</b>: Adjusted thresholds for each level: Level1==200=,
Level2==350=, Level3==450=, Level4==500=, Level5==650=</li>
<li><b>Regen Rate</b>: Adjusted per level: Level1==5=, Level2==10=,
Level3==15=, Level4==30=, Level5==60=</li>
</ul>
</div>
</div>

<div id="outline-container-org2d65edc" class="outline-4">
<h4 id="org2d65edc">T3 Seraphim Land*</h4>
<div class="outline-text-4" id="text-org2d65edc">
<ul class="org-ul">
<li>Explanation: The T3 Ilsatha unit underperformed for its cost,
especially after the Otheeka's removal. A damage and muzzle velocity
buff makes it more effective and worth its cost.</li>
<li><b>Removed Otheeka</b></li>
</ul>
<p>
<b>**</b> T3 Ilsatha*
</p>

<ul class="org-ul">
<li><b>Damage</b>: Increased from <code>55</code> to <code>65</code></li>
<li><b>Muzzle Velocity</b>: Increased from <code>30</code> to <code>40</code></li>
</ul>
</div>
</div>

<div id="outline-container-org469554f" class="outline-4">
<h4 id="org469554f">T3 Cybran Land*</h4>
<div class="outline-text-4" id="text-org469554f">
<ul class="org-ul">
<li>Explanation: The T3 Cybran Slink's effectiveness was too high for
its energy upkeep and build time, leading to an imbalance. These
changes adjust its costs and damage output to better balance its
role as a unique T3.5 MAA unit.</li>
<li><b>Removed Crawfish</b></li>
</ul>
<p>
<b>**</b> T3 Slink*
</p>

<ul class="org-ul">
<li><b>Damage</b>: Increased from <code>120</code> to <code>180</code></li>
<li><b>Energy Cost</b>: Increased from <code>12500</code> to <code>16500</code></li>
<li><b>Mass Cost</b>: Increased from <code>1250</code> to <code>1450</code></li>
<li><b>Build Time</b>: Increased from <code>41</code> seconds to <code>62</code> seconds</li>
<li><b>Energy Maintenance</b> Increased from <code>150</code> to <code>300</code></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orge6d9fe4" class="outline-2">
<h2 id="orge6d9fe4">1.65</h2>
<div class="outline-text-2" id="text-orge6d9fe4">
<ul class="org-ul">
<li>2024-10-25</li>
</ul>
</div>
<div id="outline-container-orgeec5fbf" class="outline-3">
<h3 id="orgeec5fbf">General Changes</h3>
<div class="outline-text-3" id="text-orgeec5fbf">
<ul class="org-ul">
<li>Fixed Units getting stuck in their packing/unpacking animations</li>
</ul>
</div>
</div>

<div id="outline-container-orgf46f41a" class="outline-3">
<h3 id="orgf46f41a">T3 Barrage Artillery (All Factions)</h3>
<div class="outline-text-3" id="text-orgf46f41a">
<ul class="org-ul">
<li>Explanation: The T3 Barrage Artillery's rate of fire was drastically
reduced to fix an unintended rapid fire issue, while the turret's
yaw range and speed were corrected to stop alignment problems when
aiming. Additionally, target acquisition was made faster for better
responsiveness.</li>
<li>Rate of Fire: Corrected to <code>10/90</code> from <code>10/10</code></li>
<li>Turret Yaw Range: Fixed to <code>180</code></li>
<li>Turret Yaw Speed: Fixed to <code>50</code></li>
<li>Target Check Interval: Lowered to <code>1</code> from <code>3</code></li>
</ul>
</div>
</div>

<div id="outline-container-org2f417b5" class="outline-3">
<h3 id="org2f417b5">T2 UEF Shield Boat</h3>
<div class="outline-text-3" id="text-org2f417b5">
<ul class="org-ul">
<li>Explanation: The T2 UEF Shield Boat was rebalanced to reduce its
durability and tweak shield mechanics, making it regenerate faster
but start later, with a larger shield size and adjusted damage
spillover. Its vertical offset was changed to fix issues with air
units.</li>
<li>Shield Max Health: Reduced from <code>8500</code> to <code>5500</code></li>
<li>Shield Energy Drain Recharge Time: Reduced from <code>6.2</code> to <code>5</code></li>
<li>Shield Regen Rate: Increased from <code>55</code> to <code>80</code></li>
<li>Shield Regen Start Time: Increased from <code>2</code> to <code>3</code></li>
<li>Shield Size: Increased from <code>62</code> to <code>120</code></li>
<li>Shield Spill Over Damage Modifier: Set to <code>0.50</code> (This was
previously <code>15%</code> but had a special <code>50%</code> damage spillover specific
to shield boats)</li>
<li>Shield Vertical Offset: Changed from <code>-15</code> to <code>-50</code></li>
</ul>
</div>
</div>

<div id="outline-container-org4a7e5df" class="outline-3">
<h3 id="org4a7e5df">Seraphim T2 Land</h3>
<div class="outline-text-3" id="text-org4a7e5df">
<p>
Seraphim T2 Land units struggled due to poor turn radius and muzzle velocity,
resulting in performance issues. These changes aim to address these weaknesses
by improving weapon speed and maneuverability.
</p>

<p>
Additionally, the redundant T2 Shield Protector Bot was removed.
</p>

<p>
<b>Removed T2 Shield Protector Bot</b>
</p>
</div>
<div id="outline-container-orge59879f" class="outline-4">
<h4 id="orge59879f">T2 Seraphim Iltha</h4>
<div class="outline-text-4" id="text-orge59879f">
<ul class="org-ul">
<li>Muzzle Velocity: Increased from <code>30</code> to <code>35</code></li>
<li>Turn Rate: Increased from <code>40</code> to <code>42.5</code></li>
</ul>
</div>
</div>

<div id="outline-container-org7561419" class="outline-4">
<h4 id="org7561419">T2 Seraphim Ilsavoh</h4>
<div class="outline-text-4" id="text-org7561419">
<ul class="org-ul">
<li>Muzzle Velocity: Increased from <code>32</code> to <code>36</code></li>
<li>Turn Radius: Increased from <code>0.5</code> to <code>2</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org47fc6f8" class="outline-3">
<h3 id="org47fc6f8">Aeon T2 Land</h3>
<div class="outline-text-3" id="text-org47fc6f8">
<p>
Aeon T2 Land was overly dependent on the T2 Aeon Sniper, making it the dominant
choice at T2. These adjustments balance the power dynamic, making other units
like Blaze and Obsidian more viable by adjusting costs, stats, and
functionality.
</p>
</div>

<div id="outline-container-org2c6b0c7" class="outline-4">
<h4 id="org2c6b0c7">T2 Aeon Sniper</h4>
<div class="outline-text-4" id="text-org2c6b0c7">
<ul class="org-ul">
<li>Build Time: Increased from <code>11</code> seconds to <code>47</code> seconds</li>
<li>Energy Cost: Increased from <code>5050</code> to <code>6650</code></li>
<li>Mass Cost: Increased from <code>465</code> to <code>515</code></li>
<li>Turn Rate: Increased from <code>44</code> to <code>50</code></li>
<li>Turn Radius: Reduced from <code>8</code> to <code>6</code></li>
<li>Max Speed: Increased from <code>3.6</code> to <code>3.7</code></li>
</ul>
</div>
</div>
