changelog/changelog.org
**** T2 Aeon Blaze

    - Weapon Attachment: Main weapon is now attached to the turret
      bone, fixing "hover pathfinding issues"
    - Water Speed: Reduced by =10%=
    - Rate of Fire: Increased from =2= to =3=
    - Damage: Reduced from =20= to =15=
    - Muzzle Velocity: Increased from =20= to =45=
    - Mass Cost: Reduced from =250= to =220=
    - Health: Increased from =900= to =1000=
    - Regen Rate: Reduced from =2= to =0=

**** T2 Aeon Obsidian
    - Build Time: Reduced from =33= seconds to =25= seconds

*** *Cybran T2 Land*
Stealth has been proven to be a powerful ability for Cybran as it's main trait,
therefore the need of a mobile shield is non existing.

*Removed T2 Cybran Mobile Shield*

** 1.64

*** Dynamic LODs
- Updated Dynamic LODs to be more consistent with all units across the globe
- Seperated Prop & Unit LOD Management to have different math for distances
  (Courtsy of FAF)

*** Misc
- Fix T1 Static Artillery Energy Cycle
- Fix T2.5 Cybran Immortal Missiles Missing

** 1.63
*** Skirmishers
**** T2 Aeon Sniper
- Health: 750 -> 435
**** Mongoose
- Health: 900 -> 600
**** Hoplite
- Health: 780 -> 515

*** Energy Charge

- Fix T3 Barrage Artillery Energy Charge Cycle
- Fix T3 Cybran Triseptitron Energy Charge Cycle

**** T3 Cybran Hailfire

- Add Energy Charge Cycle
- Energy Charge: -175
- Energy Required: 700

** 1.62
*** Energy Charge

- Fix T3 Mobile Artillery Energy Charge Cycle
- Fix T3 Strategic Artillery Energy Charge Cycle
- Fix T2 Static Artillery Energy Charge Cycle
- Fix T4 Experimental Artillery Energy Charge Cycle
- Fix Units with a unpack and pack animation getting stuck permanently
- Improved Units with rack/muzzle effect & sounds
- Fix ACU Overcharge Energy Charge Cycle

** 1.61

*** ACU

- Fix Cybran & Seraphim ACU missing with their main gun

*** Energy Charge

Energy Charge Cycle involves fixing long delays that cause the Unit to
lose over 100% of it's DPS causing the unit to be extremely weaker then
intended - Fix T3 Rocket PD Energy Charge Cycle - Fix T3 Sniper Energy
Charge Cycle - Fix T3 Mobile Artillery Energy Charge Cycle - Fix T2
Sniper Energy Charge Cycle

** 1.60

*** Energy Charge

- All Units that have =RackSalvoFiresAfterCharge = true,= manually
  =RenderFireClock= instead of through =StartEconomyDrain Function=
- Fix Experimental Artillery & T3 Strategic Artillery not having
  =RackSalvoFiresAfterCharge = true,=

*** Reclaim

- Fix long standing bug that was causing QUIET Reclaim Adjustments to
  not function

*** Misc

- Fix Seraphim Fighter Missing Target
- Fix T2 Tactical Bombers Dropping Short =Again=

** 1.59

*** ACU

- Removed Stealth

*** Citadel Mk1

- Fix Underside turrets Missing DualManipulators,
  =50% of guns would not pitch=, causing 50% of the guns to always fire
  at max range.
- Set fire rates to integer values
- Increased all turret pitch and yaw speeds
- Matching weapons had inconsistent stats, fixed.
- Removed AutoInitiateAttackCommand behavior

*** Soul Ripper Mk1

- Weapon ranges increased, yaw and pitch speeds up, paired weapons stats
  properly synced (they weren't before).
- SR1 is more effective at dealing with groups of units and
  entrenched/shielded groups than SR2.

*** Soul Ripper Mk2

- Extended weapon ranges, yaw and pitch speeds up, weapon behaviors
  altered
- SR2 is more effective at dealing concentrated damage on single targets
  than SR1. SR2 has more powerful AA than SR1.

** 1.58

*** T2 Gunships
- Health: 1400 -> 1100

*** ACU

- Removed AirLayer Targetting

*** ACU (Cybran)

- Fix Cybran ACU Laser

*** Misc

- Fix A Few Blueprint Variables
- Fix Amphorak Blueprint

** 1.57

*** Misc
- Fix UEF ACU Firing when reclaiming
- Fix Gunships having bad Yaw & Pitch Rates
- Fix Cybran Engineers being unkillable

** 1.56
*** ACU
- Main Gun Rate Of Fire: 2 -> 1

*** Misc
- Fix T2 UEF Tactical Bomber Dropping Bomb Too Early
- Fix AoE Applying 1 Tick Too Late
- Fix T2 Fighters Not Being Able To Hit T2 Tactical Bombers
- Fix T2 Sniper YawRate

** 1.55
*** Misc

- YawRates have been increased on many PDs
- Fixed Bone Issue on the Mastodon Rocket Pods causing them to miss
- Fixed Many Audio Issues on Total Mayhem Units

** 1.54
*** Air
- Removed Debuffs to Speed when Aircraft is Damaged
- Removed Debuffs to FuelRatio from all =flak/maa/staticaa= when
  Aircraft is Damaged

