changelog/changelog.html

<div id="outline-container-org8c243fa" class="outline-4">
<h4 id="org8c243fa">T2 Aeon Blaze</h4>
<div class="outline-text-4" id="text-org8c243fa">
<ul class="org-ul">
<li>Weapon Attachment: Main weapon is now attached to the turret
bone, fixing "hover pathfinding issues"</li>
<li>Water Speed: Reduced by <code>10%</code></li>
<li>Rate of Fire: Increased from <code>2</code> to <code>3</code></li>
<li>Damage: Reduced from <code>20</code> to <code>15</code></li>
<li>Muzzle Velocity: Increased from <code>20</code> to <code>45</code></li>
<li>Mass Cost: Reduced from <code>250</code> to <code>220</code></li>
<li>Health: Increased from <code>900</code> to <code>1000</code></li>
<li>Regen Rate: Reduced from <code>2</code> to <code>0</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgc294e08" class="outline-4">
<h4 id="orgc294e08">T2 Aeon Obsidian</h4>
<div class="outline-text-4" id="text-orgc294e08">
<ul class="org-ul">
<li>Build Time: Reduced from <code>33</code> seconds to <code>25</code> seconds</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgbbadda8" class="outline-3">
<h3 id="orgbbadda8"><b>Cybran T2 Land</b></h3>
<div class="outline-text-3" id="text-orgbbadda8">
<p>
Stealth has been proven to be a powerful ability for Cybran as it's main trait,
therefore the need of a mobile shield is non existing.
</p>

<p>
<b>Removed T2 Cybran Mobile Shield</b>
</p>
</div>
</div>
</div>

<div id="outline-container-org871f6ac" class="outline-2">
<h2 id="org871f6ac">1.64</h2>
<div class="outline-text-2" id="text-org871f6ac">
</div>
<div id="outline-container-org7c07d95" class="outline-3">
<h3 id="org7c07d95">Dynamic LODs</h3>
<div class="outline-text-3" id="text-org7c07d95">
<ul class="org-ul">
<li>Updated Dynamic LODs to be more consistent with all units across the globe</li>
<li>Seperated Prop &amp; Unit LOD Management to have different math for distances
(Courtsy of FAF)</li>
</ul>
</div>
</div>

<div id="outline-container-org7f36b17" class="outline-3">
<h3 id="org7f36b17">Misc</h3>
<div class="outline-text-3" id="text-org7f36b17">
<ul class="org-ul">
<li>Fix T1 Static Artillery Energy Cycle</li>
<li>Fix T2.5 Cybran Immortal Missiles Missing</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org37ef345" class="outline-2">
<h2 id="org37ef345">1.63</h2>
<div class="outline-text-2" id="text-org37ef345">
</div>
<div id="outline-container-org8f21b92" class="outline-3">
<h3 id="org8f21b92">Skirmishers</h3>
<div class="outline-text-3" id="text-org8f21b92">
</div>
<div id="outline-container-orgc2c5137" class="outline-4">
<h4 id="orgc2c5137">T2 Aeon Sniper</h4>
<div class="outline-text-4" id="text-orgc2c5137">
<ul class="org-ul">
<li>Health: 750 -&gt; 435</li>
</ul>
</div>
</div>
<div id="outline-container-org50b6750" class="outline-4">
<h4 id="org50b6750">Mongoose</h4>
<div class="outline-text-4" id="text-org50b6750">
<ul class="org-ul">
<li>Health: 900 -&gt; 600</li>
</ul>
</div>
</div>
<div id="outline-container-org8a20e3d" class="outline-4">
<h4 id="org8a20e3d">Hoplite</h4>
<div class="outline-text-4" id="text-org8a20e3d">
<ul class="org-ul">
<li>Health: 780 -&gt; 515</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd9e46ff" class="outline-3">
<h3 id="orgd9e46ff">Energy Charge</h3>
<div class="outline-text-3" id="text-orgd9e46ff">
<ul class="org-ul">
<li>Fix T3 Barrage Artillery Energy Charge Cycle</li>
<li>Fix T3 Cybran Triseptitron Energy Charge Cycle</li>
</ul>
</div>

<div id="outline-container-orgfed60bc" class="outline-4">
<h4 id="orgfed60bc">T3 Cybran Hailfire</h4>
<div class="outline-text-4" id="text-orgfed60bc">
<ul class="org-ul">
<li>Add Energy Charge Cycle</li>
<li>Energy Charge: -175</li>
<li>Energy Required: 700</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orge309cb8" class="outline-2">
<h2 id="orge309cb8">1.62</h2>
<div class="outline-text-2" id="text-orge309cb8">
</div>
<div id="outline-container-org6460c63" class="outline-3">
<h3 id="org6460c63">Energy Charge</h3>
<div class="outline-text-3" id="text-org6460c63">
<ul class="org-ul">
<li>Fix T3 Mobile Artillery Energy Charge Cycle</li>
<li>Fix T3 Strategic Artillery Energy Charge Cycle</li>
<li>Fix T2 Static Artillery Energy Charge Cycle</li>
<li>Fix T4 Experimental Artillery Energy Charge Cycle</li>
<li>Fix Units with a unpack and pack animation getting stuck permanently</li>
<li>Improved Units with rack/muzzle effect &amp; sounds</li>
<li>Fix ACU Overcharge Energy Charge Cycle</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org681573c" class="outline-2">
<h2 id="org681573c">1.61</h2>
<div class="outline-text-2" id="text-org681573c">
</div>
<div id="outline-container-org7936a23" class="outline-3">
<h3 id="org7936a23">ACU</h3>
<div class="outline-text-3" id="text-org7936a23">
<ul class="org-ul">
<li>Fix Cybran &amp; Seraphim ACU missing with their main gun</li>
</ul>
</div>
</div>

<div id="outline-container-orgea097dd" class="outline-3">
<h3 id="orgea097dd">Energy Charge</h3>
<div class="outline-text-3" id="text-orgea097dd">
<p>
Energy Charge Cycle involves fixing long delays that cause the Unit to
lose over 100% of it's DPS causing the unit to be extremely weaker then
intended - Fix T3 Rocket PD Energy Charge Cycle - Fix T3 Sniper Energy
Charge Cycle - Fix T3 Mobile Artillery Energy Charge Cycle - Fix T2
Sniper Energy Charge Cycle
</p>
</div>
</div>
</div>

<div id="outline-container-orgaa72458" class="outline-2">
<h2 id="orgaa72458">1.60</h2>
<div class="outline-text-2" id="text-orgaa72458">
</div>
<div id="outline-container-orge4e7652" class="outline-3">
<h3 id="orge4e7652">Energy Charge</h3>
<div class="outline-text-3" id="text-orge4e7652">
<ul class="org-ul">
<li>All Units that have <code>RackSalvoFiresAfterCharge = true,</code> manually
<code>RenderFireClock</code> instead of through <code>StartEconomyDrain Function</code></li>
<li>Fix Experimental Artillery &amp; T3 Strategic Artillery not having
<code>RackSalvoFiresAfterCharge = true,</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgf7fadfc" class="outline-3">
<h3 id="orgf7fadfc">Reclaim</h3>
<div class="outline-text-3" id="text-orgf7fadfc">
<ul class="org-ul">
<li>Fix long standing bug that was causing QUIET Reclaim Adjustments to
not function</li>
</ul>
</div>
</div>

<div id="outline-container-org98094e9" class="outline-3">
<h3 id="org98094e9">Misc</h3>
<div class="outline-text-3" id="text-org98094e9">
<ul class="org-ul">
<li>Fix Seraphim Fighter Missing Target</li>
<li>Fix T2 Tactical Bombers Dropping Short <code>Again</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org49e533b" class="outline-2">
<h2 id="org49e533b">1.59</h2>
<div class="outline-text-2" id="text-org49e533b">
</div>
<div id="outline-container-orgac9815e" class="outline-3">
<h3 id="orgac9815e">ACU</h3>
<div class="outline-text-3" id="text-orgac9815e">
<ul class="org-ul">
<li>Removed Stealth</li>
</ul>
</div>
</div>

<div id="outline-container-orgd992d61" class="outline-3">
<h3 id="orgd992d61">Citadel Mk1</h3>
<div class="outline-text-3" id="text-orgd992d61">
<ul class="org-ul">
<li>Fix Underside turrets Missing DualManipulators,
<code>50% of guns would not pitch</code>, causing 50% of the guns to always fire
at max range.</li>
<li>Set fire rates to integer values</li>
<li>Increased all turret pitch and yaw speeds</li>
<li>Matching weapons had inconsistent stats, fixed.</li>
<li>Removed AutoInitiateAttackCommand behavior</li>
</ul>
</div>
</div>

<div id="outline-container-org97ec3bd" class="outline-3">
<h3 id="org97ec3bd">Soul Ripper Mk1</h3>
<div class="outline-text-3" id="text-org97ec3bd">
<ul class="org-ul">
<li>Weapon ranges increased, yaw and pitch speeds up, paired weapons stats
properly synced (they weren't before).</li>
<li>SR1 is more effective at dealing with groups of units and
entrenched/shielded groups than SR2.</li>
</ul>
</div>
</div>

<div id="outline-container-orgaa28fbd" class="outline-3">
<h3 id="orgaa28fbd">Soul Ripper Mk2</h3>
<div class="outline-text-3" id="text-orgaa28fbd">
<ul class="org-ul">
<li>Extended weapon ranges, yaw and pitch speeds up, weapon behaviors
altered</li>
<li>SR2 is more effective at dealing concentrated damage on single targets
than SR1. SR2 has more powerful AA than SR1.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgcad190f" class="outline-2">
<h2 id="orgcad190f">1.58</h2>
<div class="outline-text-2" id="text-orgcad190f">
</div>
<div id="outline-container-orgf874b9b" class="outline-3">
<h3 id="orgf874b9b">T2 Gunships</h3>
<div class="outline-text-3" id="text-orgf874b9b">
<ul class="org-ul">
<li>Health: 1400 -&gt; 1100</li>
</ul>
</div>
</div>

<div id="outline-container-org2e46c21" class="outline-3">
<h3 id="org2e46c21">ACU</h3>
<div class="outline-text-3" id="text-org2e46c21">
<ul class="org-ul">
<li>Removed AirLayer Targetting</li>
</ul>
</div>
</div>

<div id="outline-container-orgb80231c" class="outline-3">
<h3 id="orgb80231c">ACU (Cybran)</h3>
<div class="outline-text-3" id="text-orgb80231c">
<ul class="org-ul">
<li>Fix Cybran ACU Laser</li>
</ul>
</div>
</div>

<div id="outline-container-orga9f00c7" class="outline-3">
<h3 id="orga9f00c7">Misc</h3>
<div class="outline-text-3" id="text-orga9f00c7">
<ul class="org-ul">
<li>Fix A Few Blueprint Variables</li>
<li>Fix Amphorak Blueprint</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3403d0b" class="outline-2">
<h2 id="org3403d0b">1.57</h2>
<div class="outline-text-2" id="text-org3403d0b">
</div>
<div id="outline-container-orgf29cfdd" class="outline-3">
<h3 id="orgf29cfdd">Misc</h3>
<div class="outline-text-3" id="text-orgf29cfdd">
<ul class="org-ul">
<li>Fix UEF ACU Firing when reclaiming</li>
<li>Fix Gunships having bad Yaw &amp; Pitch Rates</li>
<li>Fix Cybran Engineers being unkillable</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org01eab66" class="outline-2">
<h2 id="org01eab66">1.56</h2>
<div class="outline-text-2" id="text-org01eab66">
</div>
<div id="outline-container-org6173696" class="outline-3">
<h3 id="org6173696">ACU</h3>
<div class="outline-text-3" id="text-org6173696">
<ul class="org-ul">
<li>Main Gun Rate Of Fire: 2 -&gt; 1</li>
</ul>
</div>
</div>

<div id="outline-container-org0ca97b6" class="outline-3">
<h3 id="org0ca97b6">Misc</h3>
<div class="outline-text-3" id="text-org0ca97b6">
<ul class="org-ul">
<li>Fix T2 UEF Tactical Bomber Dropping Bomb Too Early</li>
<li>Fix AoE Applying 1 Tick Too Late</li>
<li>Fix T2 Fighters Not Being Able To Hit T2 Tactical Bombers</li>
<li>Fix T2 Sniper YawRate</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org702241c" class="outline-2">
<h2 id="org702241c">1.55</h2>
<div class="outline-text-2" id="text-org702241c">
</div>
<div id="outline-container-orgc139ff9" class="outline-3">
<h3 id="orgc139ff9">Misc</h3>
<div class="outline-text-3" id="text-orgc139ff9">
<ul class="org-ul">
<li>YawRates have been increased on many PDs</li>
<li>Fixed Bone Issue on the Mastodon Rocket Pods causing them to miss</li>
<li>Fixed Many Audio Issues on Total Mayhem Units</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2dacd07" class="outline-2">
<h2 id="org2dacd07">1.54</h2>
<div class="outline-text-2" id="text-org2dacd07">
</div>
<div id="outline-container-org80ff85f" class="outline-3">
<h3 id="org80ff85f">Air</h3>
<div class="outline-text-3" id="text-org80ff85f">
<ul class="org-ul">
<li>Removed Debuffs to Speed when Aircraft is Damaged</li>
<li>Removed Debuffs to FuelRatio from all <code>flak/maa/staticaa</code> when
Aircraft is Damaged</li>
</ul>
</div>
</div>
