changelog/changelog.org
*** T4 UEF Star Adder
- Fixed Star Adder Lasers Missing
- Reworked Lasers to be two seperate weapons
- PPC Cannons Damage: 1000 -> 2000
- Beam Laser Damage: 350 -> 175
- Beam Lasers Now Rapid Fire To Balance Out Damage Decrease
- Fixed Walking Animation To Make Him Not =Slide=

*** T2 MML
- All Speed Nerfed By 0.05
- Many Other Stats Standardized Across The Board
- MMLs should all be around the Same Strength with =Cybran Viper= being
  the best

*** T3 Cybran Leviathan
- Torp Defense Rate of Fire: 8 -> 20
  =**Twenty Would Mean Lower In This Case**=

*** Misc
- Removed Variable Transport Speeds Due To Multiple Bugs
- Fixed Penetrator Bombers Not Dropping Bombs Reliably
- Fixed QCE not being enabled properly

** 1.53

*** T3 Pen Bombers

- Fix Pen Bombers sometimes not dropping when they should

*** T3 Cybran Sub Hunter
- Nerf Torpedo Defense Rate Of Fire from 8 to 20

** 1.52
*** ACU Engineer Upgrades
- Buildtime, Mass, and Energy Reduced by 25%

*** Bombers
- All Bomber Projectiles have been returned to Vanilla Physics
- All Bomber Projectiles no longer home-in on targets

- Too compensate for this, all bombers receive =large AoE Buffs=, T2
  Bombers also receive =Damage Buff=

*** T3 UEF Brimstone

- Fixed Brimstone MuzzleBones not existing =(Causing massive LOG Spam)=

** 1.51

*** Misc

- Fixed TransportSpeedReduction NIL
- Fixed SSL0311 Shield Not Stopping AoE

** 1.50
*** Transports
The movement speed of transports now changes based on how many and which
types of units they have loaded.

- Units slow down transports based on their =TransportSpeedReduction= stat.
  If a unit has a  =TransportSpeedReduction= of 1, each instance of this unit will slow
  down the transport's =MaxAirspeed= by 1.

The primary implication of this change is that the effectiveness of the later T2/T3 Transport Drops are
significantly reduced in an intuitive way. Although this adds an
additional mechanic to the game that encourages more micro and strategic
thinking when placing units on a transport.

- TransportSpeedReduction: 0.15 (Tech 1 land units)
- TransportSpeedReduction: 0.3 (Tech 2 land units)
- TransportSpeedReduction: 0.6 (Tech 3 land units)
- TransportSpeedReduction: 1 (ACUs and SACUs)
- TransportSpeedReduction: 1 (Tech 4 land units)

*** Misc
 Fixed Miasma Artillery Overshooting =2nd Fix= All legacy Standard Mods are now
required to run QUIET to prevent crashing if you were not loading all the legacy
Standard Mods by accident

** 1.49

*** Mavor & RFSAC

*Included Additional Units That Had RackSalvoFiresAfterCharge Within QCE*

*Mavor now has RackSalvoFiresAfterCharge set to true to provide it with accurate
Rate of Fire*

*** T2 Destroyers

RackSalvoReloadTime: 3.5 Seconds

*** T3 UEF Juggernaut

Shield: 2250 -> 4400

*** T3 Aeon Armillary

Rate Of Fire: 30/10 -> 13/10

** 1.48

*** Global

All Units Guard Radius are now all santized and standardized. This will heavily
improve usage of Patrol & Attack Move.

Units now no longer walk into enemy when on Attack Move and Engineer Attack
Move when reclaiming will perform significantly better

All Units now have significantly more accurate Overlays for different Weapon
Ranges. Any Unit that was missing Weapon Ranges will now have them displayed
properly and accurately.

All Units now have accurate speeds that cooperate better with their collision
box and collision sphere size. This will enable Gunships & Beam Weapons to hit
significantly more often.

All Units now have an AverageDensity based on HP which allows the Engine
determine who pushes who in a collision event. This allows heavier units to move
through lighter units with ease and heavily improves Pathfinding in certain
situations.

All Weapons [Units] now have a standardized and santized TargetCheckInterval
based on their weapon type. Weapons also all have a standardized TrackingRadius
and Variables included [AlwaysRecheckTarget] are now also standardized and will
significantly improve Weapon Behavior

Props now have a much larger visual display and should appear much easier and
at a higher camera angle then previously

*** Seraphim ACU
*Lower Number is Buff*
ACU Lambda Rate of Fire: 9 -> 7

*** T3 Mobile Artillery
Mass Cost: 500 -> 800

*** Seraphim TMD
Rate of Fire: 1.05 -> 1.3

*** Misc
Fix T4 Cybran Monkeylord Weapons being Broken Remove T3 UEF Walrus

** 1.47

Fixed 7.13 WeaponState Issue A Long Term Fix is being worked on for future
releases

** 1.46
*** Physics Reworks

*Physics Reworks allow them to be more microable and able to drop bombs more
reliably*

Penetrator Bombers T3 Gunships T3 (Including Penetrator Gunships)

*** ACUs

[Main-Gun] Damage: 120 -> 100

*** T2 Destroyers
[Torpedo-Defense] MuzzleSalvoDelay: 0 -> 0.2

*** Misc
All Units now have the DRAGBUILD Category

Removed T4 UEF Ivan

** 1.45

*** Yaw Rate Increase

Many units have received a 2 second~ Yaw Rate now and should be
microable this applies to most units in the game currently

