changelog/changelog.html

<div id="outline-container-org871609b" class="outline-3">
<h3 id="org871609b">T4 UEF Star Adder</h3>
<div class="outline-text-3" id="text-org871609b">
<ul class="org-ul">
<li>Fixed Star Adder Lasers Missing</li>
<li>Reworked Lasers to be two seperate weapons</li>
<li>PPC Cannons Damage: 1000 -&gt; 2000</li>
<li>Beam Laser Damage: 350 -&gt; 175</li>
<li>Beam Lasers Now Rapid Fire To Balance Out Damage Decrease</li>
<li>Fixed Walking Animation To Make Him Not <code>Slide</code></li>
</ul>
</div>
</div>

<div id="outline-container-org205ffd5" class="outline-3">
<h3 id="org205ffd5">T2 MML</h3>
<div class="outline-text-3" id="text-org205ffd5">
<ul class="org-ul">
<li>All Speed Nerfed By 0.05</li>
<li>Many Other Stats Standardized Across The Board</li>
<li>MMLs should all be around the Same Strength with <code>Cybran Viper</code> being
the best</li>
</ul>
</div>
</div>

<div id="outline-container-org7453f19" class="outline-3">
<h3 id="org7453f19">T3 Cybran Leviathan</h3>
<div class="outline-text-3" id="text-org7453f19">
<ul class="org-ul">
<li>Torp Defense Rate of Fire: 8 -&gt; 20
<code>**Twenty Would Mean Lower In This Case**</code></li>
</ul>
</div>
</div>

<div id="outline-container-org7cf565e" class="outline-3">
<h3 id="org7cf565e">Misc</h3>
<div class="outline-text-3" id="text-org7cf565e">
<ul class="org-ul">
<li>Removed Variable Transport Speeds Due To Multiple Bugs</li>
<li>Fixed Penetrator Bombers Not Dropping Bombs Reliably</li>
<li>Fixed QCE not being enabled properly</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org399d556" class="outline-2">
<h2 id="org399d556">1.53</h2>
<div class="outline-text-2" id="text-org399d556">
</div>
<div id="outline-container-org253ca3c" class="outline-3">
<h3 id="org253ca3c">T3 Pen Bombers</h3>
<div class="outline-text-3" id="text-org253ca3c">
<ul class="org-ul">
<li>Fix Pen Bombers sometimes not dropping when they should</li>
</ul>
</div>
</div>

<div id="outline-container-org5217fb5" class="outline-3">
<h3 id="org5217fb5">T3 Cybran Sub Hunter</h3>
<div class="outline-text-3" id="text-org5217fb5">
<ul class="org-ul">
<li>Nerf Torpedo Defense Rate Of Fire from 8 to 20</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6433f74" class="outline-2">
<h2 id="org6433f74">1.52</h2>
<div class="outline-text-2" id="text-org6433f74">
</div>
<div id="outline-container-org53ac3bf" class="outline-3">
<h3 id="org53ac3bf">ACU Engineer Upgrades</h3>
<div class="outline-text-3" id="text-org53ac3bf">
<ul class="org-ul">
<li>Buildtime, Mass, and Energy Reduced by 25%</li>
</ul>
</div>
</div>

<div id="outline-container-orgd26990f" class="outline-3">
<h3 id="orgd26990f">Bombers</h3>
<div class="outline-text-3" id="text-orgd26990f">
<ul class="org-ul">
<li>All Bomber Projectiles have been returned to Vanilla Physics</li>
<li>All Bomber Projectiles no longer home-in on targets</li>

<li>Too compensate for this, all bombers receive <code>large AoE Buffs</code>, T2
Bombers also receive <code>Damage Buff</code></li>
</ul>
</div>
</div>

<div id="outline-container-org7a72103" class="outline-3">
<h3 id="org7a72103">T3 UEF Brimstone</h3>
<div class="outline-text-3" id="text-org7a72103">
<ul class="org-ul">
<li>Fixed Brimstone MuzzleBones not existing <code>(Causing massive LOG Spam)</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org5623576" class="outline-2">
<h2 id="org5623576">1.51</h2>
<div class="outline-text-2" id="text-org5623576">
</div>
<div id="outline-container-org277c15b" class="outline-3">
<h3 id="org277c15b">Misc</h3>
<div class="outline-text-3" id="text-org277c15b">
<ul class="org-ul">
<li>Fixed TransportSpeedReduction NIL</li>
<li>Fixed SSL0311 Shield Not Stopping AoE</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgeebd3e8" class="outline-2">
<h2 id="orgeebd3e8">1.50</h2>
<div class="outline-text-2" id="text-orgeebd3e8">
</div>
<div id="outline-container-org44b47ff" class="outline-3">
<h3 id="org44b47ff">Transports</h3>
<div class="outline-text-3" id="text-org44b47ff">
<p>
The movement speed of transports now changes based on how many and which
types of units they have loaded.
</p>

<ul class="org-ul">
<li>Units slow down transports based on their <code>TransportSpeedReduction</code> stat.
If a unit has a  <code>TransportSpeedReduction</code> of 1, each instance of this unit will slow
down the transport's <code>MaxAirspeed</code> by 1.</li>
</ul>

<p>
The primary implication of this change is that the effectiveness of the later T2/T3 Transport Drops are
significantly reduced in an intuitive way. Although this adds an
additional mechanic to the game that encourages more micro and strategic
thinking when placing units on a transport.
</p>

<ul class="org-ul">
<li>TransportSpeedReduction: 0.15 (Tech 1 land units)</li>
<li>TransportSpeedReduction: 0.3 (Tech 2 land units)</li>
<li>TransportSpeedReduction: 0.6 (Tech 3 land units)</li>
<li>TransportSpeedReduction: 1 (ACUs and SACUs)</li>
<li>TransportSpeedReduction: 1 (Tech 4 land units)</li>
</ul>
</div>
</div>

<div id="outline-container-orgd5fdaec" class="outline-3">
<h3 id="orgd5fdaec">Misc</h3>
<div class="outline-text-3" id="text-orgd5fdaec">
<p>
 Fixed Miasma Artillery Overshooting <code>2nd Fix</code> All legacy Standard Mods are now
required to run QUIET to prevent crashing if you were not loading all the legacy
Standard Mods by accident
</p>
</div>
</div>
</div>

<div id="outline-container-orgf2e7dd7" class="outline-2">
<h2 id="orgf2e7dd7">1.49</h2>
<div class="outline-text-2" id="text-orgf2e7dd7">
</div>
<div id="outline-container-orga679e10" class="outline-3">
<h3 id="orga679e10">Mavor &amp; RFSAC</h3>
<div class="outline-text-3" id="text-orga679e10">
<p>
<b>Included Additional Units That Had RackSalvoFiresAfterCharge Within QCE</b>
</p>

<p>
<b>Mavor now has RackSalvoFiresAfterCharge set to true to provide it with accurate
Rate of Fire</b>
</p>
</div>
</div>

<div id="outline-container-org7558be3" class="outline-3">
<h3 id="org7558be3">T2 Destroyers</h3>
<div class="outline-text-3" id="text-org7558be3">
<p>
RackSalvoReloadTime: 3.5 Seconds
</p>
</div>
</div>

<div id="outline-container-org108b58a" class="outline-3">
<h3 id="org108b58a">T3 UEF Juggernaut</h3>
<div class="outline-text-3" id="text-org108b58a">
<p>
Shield: 2250 -&gt; 4400
</p>
</div>
</div>

<div id="outline-container-org82bab16" class="outline-3">
<h3 id="org82bab16">T3 Aeon Armillary</h3>
<div class="outline-text-3" id="text-org82bab16">
<p>
Rate Of Fire: 30/10 -&gt; 13/10
</p>
</div>
</div>
</div>

<div id="outline-container-orgbcafef1" class="outline-2">
<h2 id="orgbcafef1">1.48</h2>
<div class="outline-text-2" id="text-orgbcafef1">
</div>
<div id="outline-container-org0f1b40b" class="outline-3">
<h3 id="org0f1b40b">Global</h3>
<div class="outline-text-3" id="text-org0f1b40b">
<p>
All Units Guard Radius are now all santized and standardized. This will heavily
improve usage of Patrol &amp; Attack Move.
</p>

<p>
Units now no longer walk into enemy when on Attack Move and Engineer Attack
Move when reclaiming will perform significantly better
</p>

<p>
All Units now have significantly more accurate Overlays for different Weapon
Ranges. Any Unit that was missing Weapon Ranges will now have them displayed
properly and accurately.
</p>

<p>
All Units now have accurate speeds that cooperate better with their collision
box and collision sphere size. This will enable Gunships &amp; Beam Weapons to hit
significantly more often.
</p>

<p>
All Units now have an AverageDensity based on HP which allows the Engine
determine who pushes who in a collision event. This allows heavier units to move
through lighter units with ease and heavily improves Pathfinding in certain
situations.
</p>

<p>
All Weapons [Units] now have a standardized and santized TargetCheckInterval
based on their weapon type. Weapons also all have a standardized TrackingRadius
and Variables included [AlwaysRecheckTarget] are now also standardized and will
significantly improve Weapon Behavior
</p>

<p>
Props now have a much larger visual display and should appear much easier and
at a higher camera angle then previously
</p>
</div>
</div>

<div id="outline-container-orgfa1ec03" class="outline-3">
<h3 id="orgfa1ec03">Seraphim ACU</h3>
<div class="outline-text-3" id="text-orgfa1ec03">
<p>
<b>Lower Number is Buff</b>
ACU Lambda Rate of Fire: 9 -&gt; 7
</p>
</div>
</div>

<div id="outline-container-orgced9d58" class="outline-3">
<h3 id="orgced9d58">T3 Mobile Artillery</h3>
<div class="outline-text-3" id="text-orgced9d58">
<p>
Mass Cost: 500 -&gt; 800
</p>
</div>
</div>

<div id="outline-container-orgb6de1bd" class="outline-3">
<h3 id="orgb6de1bd">Seraphim TMD</h3>
<div class="outline-text-3" id="text-orgb6de1bd">
<p>
Rate of Fire: 1.05 -&gt; 1.3
</p>
</div>
</div>

<div id="outline-container-orgf20d2ef" class="outline-3">
<h3 id="orgf20d2ef">Misc</h3>
<div class="outline-text-3" id="text-orgf20d2ef">
<p>
Fix T4 Cybran Monkeylord Weapons being Broken Remove T3 UEF Walrus
</p>
</div>
</div>
</div>

<div id="outline-container-org121158c" class="outline-2">
<h2 id="org121158c">1.47</h2>
<div class="outline-text-2" id="text-org121158c">
<p>
Fixed 7.13 WeaponState Issue A Long Term Fix is being worked on for future
releases
</p>
</div>
</div>

<div id="outline-container-org0fd6893" class="outline-2">
<h2 id="org0fd6893">1.46</h2>
<div class="outline-text-2" id="text-org0fd6893">
</div>
<div id="outline-container-orgc323f26" class="outline-3">
<h3 id="orgc323f26">Physics Reworks</h3>
<div class="outline-text-3" id="text-orgc323f26">
<p>
<b>Physics Reworks allow them to be more microable and able to drop bombs more
reliably</b>
</p>

<p>
Penetrator Bombers T3 Gunships T3 (Including Penetrator Gunships)
</p>
</div>
</div>

<div id="outline-container-org82005ca" class="outline-3">
<h3 id="org82005ca">ACUs</h3>
<div class="outline-text-3" id="text-org82005ca">
<p>
[Main-Gun] Damage: 120 -&gt; 100
</p>
</div>
</div>

<div id="outline-container-orgf82778a" class="outline-3">
<h3 id="orgf82778a">T2 Destroyers</h3>
<div class="outline-text-3" id="text-orgf82778a">
<p>
[Torpedo-Defense] MuzzleSalvoDelay: 0 -&gt; 0.2
</p>
</div>
</div>

<div id="outline-container-org0e5377b" class="outline-3">
<h3 id="org0e5377b">Misc</h3>
<div class="outline-text-3" id="text-org0e5377b">
<p>
All Units now have the DRAGBUILD Category
</p>

<p>
Removed T4 UEF Ivan
</p>
</div>
</div>
</div>

<div id="outline-container-orgd327e16" class="outline-2">
<h2 id="orgd327e16">1.45</h2>
<div class="outline-text-2" id="text-orgd327e16">
</div>
<div id="outline-container-org5c1d345" class="outline-3">
<h3 id="org5c1d345">Yaw Rate Increase</h3>
<div class="outline-text-3" id="text-org5c1d345">
<p>
Many units have received a 2 second~ Yaw Rate now and should be
microable this applies to most units in the game currently
</p>
</div>
</div>
