changelog/changelog.org
*** T3 UEF Banisher

ROF: 25/10 -> 18/10 AA Missile Denations at 10 Height Now

*** T3 Aeon Armillary

Damage: 75 -> 65

*** T3 Cybran Hailfire

FiringRandomnessWhileMoving: 0.7 -> 0.5

*** T4 Aeon Pillar of Prominence

ShieldRegenRate: 230 -> 520 (Allows it's shields on other units to be
healed more quickly)

*** T3 Cybran Dervish

Dervish Rockets receive the same rework as Madbolo & Vulture

*** T3 UEF Bull

[Rockets] MuzzleChargeDelay: 0.6 -> 0.3 MaxRadius: 48 -> 44

*** T3 Cybran Mastodon

[Rockets] FiringRandomnessWhileMoving: 3.5 -> 1.5

*** T1 Aeon Wavecrest

MuzzleSalvoDelay: 0.3 -> 0.2

** 1.44

*** T1 Cybran Sky Slammer

FiringTolerance 0.6 -> 3 YawTurretSpeed 36 -> 135

*** T1 Aeon Artos
Health 210 -> 140 (Missile) Range 32 -> 30

*** T1 Scouts
Stealth Removed

*** T4 Aeon Eliash
Mass Cost 21000 -> 26000

*** T4 Cybran Vulture
Please refer to PR #220 for the extensives changelog

*** Misc

Fixed Evenflow not applying to all units if one unit contained
"IgnoreEvenflow" Value. Fixed T3 Cybran PD "Hades"

** 1.43

*** ACU

TurretYawSpeed [Main Weapon] 48 -> 90 Main Weapon Damage 70 -> 120 Range
Equalized to OverCharge Range of 30 Speed from 1.45 -> 1.7

*** T1.5

All T1.5 now are the first users of the ability to ignore Evenflow They
now follow guidelines of a much heavier buildtime with some slight
reductions in cost and some factional diversity increase (this is an
ongoing effort) Please Review PR #219 for the stat changes

*** Misc
Fix Thau Battery Projectiles disappearing before hitting the ground

** 1.42
*** T4 Cybran Madbolo

MassCost 21750 -> 30000
EnergyCost 300000 -> 475000

*** Misc

Fix Thug being unbuildable (2nd try) Fix Scorpion having Stealth

** 1.41
Many Units have received YawTurretSpeed Buffs to allow them to be
microable if you are interested in what units please check PR #209 for
reference

*** T2 Aeon Amphorak

Damage is brought in line with other T2.5 (Around 120DPS)

No longer cost energy to fire

*** T2 Cybran Hoplite
RoF = 10/40 Damage reduced from 75 -> 65

*** Misc
- Fixed AI not being able to Overcharge
- Introduce Various new economic rebalances in our Submod called QCE Economy &
  Flow, please refer to commit #707be96325bcbae0951caf29d76962611acad45a for
  reference
- Fixed Avernus Shoulder Cannon Projectile being extremely small
- Fixed Eliash not actually having a visual shield on the unit
- Fixed Thug PD not being buildable
- Fixed Pegasus ShieldIsUp (AoE can not splash through the
Pegasus Personal Shield)

** 1.40
*** T2 UEF Mongoose
Grenade Launcher: Damage 62 -> 49
RoF for Gatling Gun 1 Second -> 1.2 Second

*** Overcharge

Energy Ratio 6 -> 9 (TLDR It takes more energy to do more damage)

*** T3 Barrage Artillery
Nerfed FiringRandomness 1.25 -> 2.25 AoF nerfed from by a universal number of 1

*** Misc
- Fixed Dragonite Shield Not Actually Protecting It
- Fixed Eliash Shield Not Actually Protecting It

** 1.39
*** T1, T2, T3 Aeon Artillery

Fix Artillery Overshooting for Aeon

** 1.38
*** Torpedo Defenses

All vanilla torpedo defenses have been 'altered' so that they are now targetable
by surface weapons

** 1.37

*** T4 Aeon Avernus

*Comparable To King Kraptor*

Meant for dealing with Experimentals only, lacks almost any AOE so it's weak vs
larger T3 Armies however deals massive precision DPS vs Experimentals. The
bigger and heavier the Experimental, the better. (Except Avalanche lol)

*** T4 Cybran Vulture
Receives Rocket Barrage Rework Equal to Madbolo

*** Misc

Fix Hardlock on Naval Maps

** 1.36

*** T4 Aeon Eliash

Transformed Personal Shield -> Bubble Shield

*** T3 Aeon Mobile Artillery
Removed +20% Shield Damage

*** T4 Cybran Madbolo
All Weapons Ranges Increases Rework Primary Weapon Rocket Barrage (High
Muzzle Velocity, More Accuracy, More Rockets)

*** T3 UEF Brimstone
Yawspeed 27 -> 45 Fix Brimstone Overshooting

*** T1 Mayor PD
Yawspeed 45 -> 90

** 1.35
*** T2 MML
Speed 3 -> 2.85
*** T3 Mobile Artillery
Fix the unpack rate that was making units stuck in place
*** T3 Barrage Artillery (Accouts for Overspill now in balancing)
DamageRadius reduced by 1 on all FiringRandomness 1.25 -> 2.25
** 1.34
