changelog/changelog.html

<div id="outline-container-orge25a3a0" class="outline-3">
<h3 id="orge25a3a0">T3 UEF Banisher</h3>
<div class="outline-text-3" id="text-orge25a3a0">
<p>
ROF: 25/10 -&gt; 18/10 AA Missile Denations at 10 Height Now
</p>
</div>
</div>

<div id="outline-container-org764ed2e" class="outline-3">
<h3 id="org764ed2e">T3 Aeon Armillary</h3>
<div class="outline-text-3" id="text-org764ed2e">
<p>
Damage: 75 -&gt; 65
</p>
</div>
</div>

<div id="outline-container-orgefeba2b" class="outline-3">
<h3 id="orgefeba2b">T3 Cybran Hailfire</h3>
<div class="outline-text-3" id="text-orgefeba2b">
<p>
FiringRandomnessWhileMoving: 0.7 -&gt; 0.5
</p>
</div>
</div>

<div id="outline-container-org1d90d66" class="outline-3">
<h3 id="org1d90d66">T4 Aeon Pillar of Prominence</h3>
<div class="outline-text-3" id="text-org1d90d66">
<p>
ShieldRegenRate: 230 -&gt; 520 (Allows it's shields on other units to be
healed more quickly)
</p>
</div>
</div>

<div id="outline-container-org74b5a92" class="outline-3">
<h3 id="org74b5a92">T3 Cybran Dervish</h3>
<div class="outline-text-3" id="text-org74b5a92">
<p>
Dervish Rockets receive the same rework as Madbolo &amp; Vulture
</p>
</div>
</div>

<div id="outline-container-org0ca92ad" class="outline-3">
<h3 id="org0ca92ad">T3 UEF Bull</h3>
<div class="outline-text-3" id="text-org0ca92ad">
<p>
[Rockets] MuzzleChargeDelay: 0.6 -&gt; 0.3 MaxRadius: 48 -&gt; 44
</p>
</div>
</div>

<div id="outline-container-orgb19a0b3" class="outline-3">
<h3 id="orgb19a0b3">T3 Cybran Mastodon</h3>
<div class="outline-text-3" id="text-orgb19a0b3">
<p>
[Rockets] FiringRandomnessWhileMoving: 3.5 -&gt; 1.5
</p>
</div>
</div>

<div id="outline-container-org4dd6d82" class="outline-3">
<h3 id="org4dd6d82">T1 Aeon Wavecrest</h3>
<div class="outline-text-3" id="text-org4dd6d82">
<p>
MuzzleSalvoDelay: 0.3 -&gt; 0.2
</p>
</div>
</div>
</div>

<div id="outline-container-org7ebda0d" class="outline-2">
<h2 id="org7ebda0d">1.44</h2>
<div class="outline-text-2" id="text-org7ebda0d">
</div>
<div id="outline-container-org5327fcc" class="outline-3">
<h3 id="org5327fcc">T1 Cybran Sky Slammer</h3>
<div class="outline-text-3" id="text-org5327fcc">
<p>
FiringTolerance 0.6 -&gt; 3 YawTurretSpeed 36 -&gt; 135
</p>
</div>
</div>

<div id="outline-container-org4fcd79b" class="outline-3">
<h3 id="org4fcd79b">T1 Aeon Artos</h3>
<div class="outline-text-3" id="text-org4fcd79b">
<p>
Health 210 -&gt; 140 (Missile) Range 32 -&gt; 30
</p>
</div>
</div>

<div id="outline-container-org6604bae" class="outline-3">
<h3 id="org6604bae">T1 Scouts</h3>
<div class="outline-text-3" id="text-org6604bae">
<p>
Stealth Removed
</p>
</div>
</div>

<div id="outline-container-orgc7ef89d" class="outline-3">
<h3 id="orgc7ef89d">T4 Aeon Eliash</h3>
<div class="outline-text-3" id="text-orgc7ef89d">
<p>
Mass Cost 21000 -&gt; 26000
</p>
</div>
</div>

<div id="outline-container-orga19e522" class="outline-3">
<h3 id="orga19e522">T4 Cybran Vulture</h3>
<div class="outline-text-3" id="text-orga19e522">
<p>
Please refer to PR #220 for the extensives changelog
</p>
</div>
</div>

<div id="outline-container-org9f923c0" class="outline-3">
<h3 id="org9f923c0">Misc</h3>
<div class="outline-text-3" id="text-org9f923c0">
<p>
Fixed Evenflow not applying to all units if one unit contained
"IgnoreEvenflow" Value. Fixed T3 Cybran PD "Hades"
</p>
</div>
</div>
</div>

<div id="outline-container-orgc07f228" class="outline-2">
<h2 id="orgc07f228">1.43</h2>
<div class="outline-text-2" id="text-orgc07f228">
</div>
<div id="outline-container-org6c979bd" class="outline-3">
<h3 id="org6c979bd">ACU</h3>
<div class="outline-text-3" id="text-org6c979bd">
<p>
TurretYawSpeed [Main Weapon] 48 -&gt; 90 Main Weapon Damage 70 -&gt; 120 Range
Equalized to OverCharge Range of 30 Speed from 1.45 -&gt; 1.7
</p>
</div>
</div>

<div id="outline-container-orgd450f22" class="outline-3">
<h3 id="orgd450f22">T1.5</h3>
<div class="outline-text-3" id="text-orgd450f22">
<p>
All T1.5 now are the first users of the ability to ignore Evenflow They
now follow guidelines of a much heavier buildtime with some slight
reductions in cost and some factional diversity increase (this is an
ongoing effort) Please Review PR #219 for the stat changes
</p>
</div>
</div>

<div id="outline-container-org28b327b" class="outline-3">
<h3 id="org28b327b">Misc</h3>
<div class="outline-text-3" id="text-org28b327b">
<p>
Fix Thau Battery Projectiles disappearing before hitting the ground
</p>
</div>
</div>
</div>

<div id="outline-container-org819d304" class="outline-2">
<h2 id="org819d304">1.42</h2>
<div class="outline-text-2" id="text-org819d304">
</div>
<div id="outline-container-org7f65e62" class="outline-3">
<h3 id="org7f65e62">T4 Cybran Madbolo</h3>
<div class="outline-text-3" id="text-org7f65e62">
<p>
MassCost 21750 -&gt; 30000
EnergyCost 300000 -&gt; 475000
</p>
</div>
</div>

<div id="outline-container-org740e3a2" class="outline-3">
<h3 id="org740e3a2">Misc</h3>
<div class="outline-text-3" id="text-org740e3a2">
<p>
Fix Thug being unbuildable (2nd try) Fix Scorpion having Stealth
</p>
</div>
</div>
</div>

<div id="outline-container-orgc4aeea3" class="outline-2">
<h2 id="orgc4aeea3">1.41</h2>
<div class="outline-text-2" id="text-orgc4aeea3">
<p>
Many Units have received YawTurretSpeed Buffs to allow them to be
microable if you are interested in what units please check PR #209 for
reference
</p>
</div>

<div id="outline-container-org82912fb" class="outline-3">
<h3 id="org82912fb">T2 Aeon Amphorak</h3>
<div class="outline-text-3" id="text-org82912fb">
<p>
Damage is brought in line with other T2.5 (Around 120DPS)
</p>

<p>
No longer cost energy to fire
</p>
</div>
</div>

<div id="outline-container-org385197c" class="outline-3">
<h3 id="org385197c">T2 Cybran Hoplite</h3>
<div class="outline-text-3" id="text-org385197c">
<p>
RoF = 10/40 Damage reduced from 75 -&gt; 65
</p>
</div>
</div>

<div id="outline-container-org346a85e" class="outline-3">
<h3 id="org346a85e">Misc</h3>
<div class="outline-text-3" id="text-org346a85e">
<ul class="org-ul">
<li>Fixed AI not being able to Overcharge</li>
<li>Introduce Various new economic rebalances in our Submod called QCE Economy &amp;
Flow, please refer to commit #707be96325bcbae0951caf29d76962611acad45a for
reference</li>
<li>Fixed Avernus Shoulder Cannon Projectile being extremely small</li>
<li>Fixed Eliash not actually having a visual shield on the unit</li>
<li>Fixed Thug PD not being buildable</li>
<li>Fixed Pegasus ShieldIsUp (AoE can not splash through the</li>
</ul>
<p>
Pegasus Personal Shield)
</p>
</div>
</div>
</div>

<div id="outline-container-orgc6abfeb" class="outline-2">
<h2 id="orgc6abfeb">1.40</h2>
<div class="outline-text-2" id="text-orgc6abfeb">
</div>
<div id="outline-container-org7ae4d0c" class="outline-3">
<h3 id="org7ae4d0c">T2 UEF Mongoose</h3>
<div class="outline-text-3" id="text-org7ae4d0c">
<p>
Grenade Launcher: Damage 62 -&gt; 49
RoF for Gatling Gun 1 Second -&gt; 1.2 Second
</p>
</div>
</div>

<div id="outline-container-org0a667ab" class="outline-3">
<h3 id="org0a667ab">Overcharge</h3>
<div class="outline-text-3" id="text-org0a667ab">
<p>
Energy Ratio 6 -&gt; 9 (TLDR It takes more energy to do more damage)
</p>
</div>
</div>

<div id="outline-container-orgb522bd1" class="outline-3">
<h3 id="orgb522bd1">T3 Barrage Artillery</h3>
<div class="outline-text-3" id="text-orgb522bd1">
<p>
Nerfed FiringRandomness 1.25 -&gt; 2.25 AoF nerfed from by a universal number of 1
</p>
</div>
</div>

<div id="outline-container-org5bd5f49" class="outline-3">
<h3 id="org5bd5f49">Misc</h3>
<div class="outline-text-3" id="text-org5bd5f49">
<ul class="org-ul">
<li>Fixed Dragonite Shield Not Actually Protecting It</li>
<li>Fixed Eliash Shield Not Actually Protecting It</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6d96563" class="outline-2">
<h2 id="org6d96563">1.39</h2>
<div class="outline-text-2" id="text-org6d96563">
</div>
<div id="outline-container-org374020e" class="outline-3">
<h3 id="org374020e">T1, T2, T3 Aeon Artillery</h3>
<div class="outline-text-3" id="text-org374020e">
<p>
Fix Artillery Overshooting for Aeon
</p>
</div>
</div>
</div>

<div id="outline-container-org9d9dea4" class="outline-2">
<h2 id="org9d9dea4">1.38</h2>
<div class="outline-text-2" id="text-org9d9dea4">
</div>
<div id="outline-container-org2cf55ef" class="outline-3">
<h3 id="org2cf55ef">Torpedo Defenses</h3>
<div class="outline-text-3" id="text-org2cf55ef">
<p>
All vanilla torpedo defenses have been 'altered' so that they are now targetable
by surface weapons
</p>
</div>
</div>
</div>

<div id="outline-container-orga9ea598" class="outline-2">
<h2 id="orga9ea598">1.37</h2>
<div class="outline-text-2" id="text-orga9ea598">
</div>
<div id="outline-container-org14c5381" class="outline-3">
<h3 id="org14c5381">T4 Aeon Avernus</h3>
<div class="outline-text-3" id="text-org14c5381">
<p>
<b>Comparable To King Kraptor</b>
</p>

<p>
Meant for dealing with Experimentals only, lacks almost any AOE so it's weak vs
larger T3 Armies however deals massive precision DPS vs Experimentals. The
bigger and heavier the Experimental, the better. (Except Avalanche lol)
</p>
</div>
</div>

<div id="outline-container-org4dae483" class="outline-3">
<h3 id="org4dae483">T4 Cybran Vulture</h3>
<div class="outline-text-3" id="text-org4dae483">
<p>
Receives Rocket Barrage Rework Equal to Madbolo
</p>
</div>
</div>

<div id="outline-container-org84d22c7" class="outline-3">
<h3 id="org84d22c7">Misc</h3>
<div class="outline-text-3" id="text-org84d22c7">
<p>
Fix Hardlock on Naval Maps
</p>
</div>
</div>
</div>

<div id="outline-container-org8b35acd" class="outline-2">
<h2 id="org8b35acd">1.36</h2>
<div class="outline-text-2" id="text-org8b35acd">
</div>
<div id="outline-container-orgc1758ba" class="outline-3">
<h3 id="orgc1758ba">T4 Aeon Eliash</h3>
<div class="outline-text-3" id="text-orgc1758ba">
<p>
Transformed Personal Shield -&gt; Bubble Shield
</p>
</div>
</div>

<div id="outline-container-org8711715" class="outline-3">
<h3 id="org8711715">T3 Aeon Mobile Artillery</h3>
<div class="outline-text-3" id="text-org8711715">
<p>
Removed +20% Shield Damage
</p>
</div>
</div>

<div id="outline-container-org3514175" class="outline-3">
<h3 id="org3514175">T4 Cybran Madbolo</h3>
<div class="outline-text-3" id="text-org3514175">
<p>
All Weapons Ranges Increases Rework Primary Weapon Rocket Barrage (High
Muzzle Velocity, More Accuracy, More Rockets)
</p>
</div>
</div>

<div id="outline-container-org69de2d4" class="outline-3">
<h3 id="org69de2d4">T3 UEF Brimstone</h3>
<div class="outline-text-3" id="text-org69de2d4">
<p>
Yawspeed 27 -&gt; 45 Fix Brimstone Overshooting
</p>
</div>
</div>

<div id="outline-container-orgad201a0" class="outline-3">
<h3 id="orgad201a0">T1 Mayor PD</h3>
<div class="outline-text-3" id="text-orgad201a0">
<p>
Yawspeed 45 -&gt; 90
</p>
</div>
</div>
</div>

<div id="outline-container-org01e9f89" class="outline-2">
<h2 id="org01e9f89">1.35</h2>
<div class="outline-text-2" id="text-org01e9f89">
</div>
<div id="outline-container-orgbcc39f1" class="outline-3">
<h3 id="orgbcc39f1">T2 MML</h3>
<div class="outline-text-3" id="text-orgbcc39f1">
<p>
Speed 3 -&gt; 2.85
</p>
</div>
</div>
<div id="outline-container-org5f8d94b" class="outline-3">
<h3 id="org5f8d94b">T3 Mobile Artillery</h3>
<div class="outline-text-3" id="text-org5f8d94b">
<p>
Fix the unpack rate that was making units stuck in place
</p>
</div>
</div>
<div id="outline-container-org71043b5" class="outline-3">
<h3 id="org71043b5">T3 Barrage Artillery (Accouts for Overspill now in balancing)</h3>
<div class="outline-text-3" id="text-org71043b5">
<p>
DamageRadius reduced by 1 on all FiringRandomness 1.25 -&gt; 2.25
</p>
</div>
</div>
</div>
