changelog/changelog.org
*** No More Roaming
Removed Roaming Behavior From All Experimentals
*** Shields

General Info on shields is that they will take longer to regenerate, many stats
have been standardized then redistributed to give a bit more diversity to the
shields.

Integrated Shields received a bit of a hard bonking as their stats were not
justified by the current cost. They were all given 20k+ E Cost and around
500-1000 Mass Cost as well as given the regeneration nerfs and etc.

Shields offset were standardized a bit to prevent some of the outrageous shield
layering. (Anti Artillery Shield for UEF is untouched by any of these changes as
well as Cybran Shields inbetween the final & first upgrade)

All Square Shields have been removed and replaced by significantly buffed
BrewLAN Experimental Shields that have been completely reworked to fit into the
Experimental Phase of the game.

*** T2 Cybran Hoplite
Range 42 -> 37

*** T2 UEF Mongoose
Range 34 -> 32

*** T3 Pervical | Brick | Harbinger
TurretYawSpeed 35 -> 90

*** T3 UEF Pervical
Damage 900 -> 1450 RoF 0.5 -> 0.23

*** T3 Aeon Harbinger
No Longer Fires two shoots in one Salvo RoF increased to 2 (2 Shoots 2
Salvos)

*** T3 Seraphim Thau Battery

-20% Reduction Against Shields Removed DamageRadius 2 -> 3.5

*** T4 Cybran Megalith
Energy Cost 450000 -> 785500

*** Misc
Removed Cybran T3 Sniper

** 1.33
*** Weapon States
All Weapon States (Excluding WeaponFiringState) have been rewritten to a
cleaner standard and to reduce the amount of unnessacry states many
units were going through. This causes latency and delay as well as other
strange bugs in units. This is a extremely deep and fundamental change
to the game and I expect some units to be broken. (Please report them in
our discord ASAP for hotfixes)

*** Misc
Fix T2 UEF Statue rockets

Fix T2 UEF Pillar DPS

Fix T3 Aeon Wraith Pathfinding

Fix T3 Cybran Tripple Threat DPS & Firing States

Fix T3 UEF Brimstone DPS & Firing States

Fix T3 Aeon Mothra DPS & Firing States

Fix T3 Cybran Neolith DPS & Firing States

Fix Seraphim Commander not shooting the correct projectile

** 1.32

*** Wraith

- Acceleration 1.5 -> 2
- BackUpDistance = 10
- TurnFacingRate 20 -> 55
- TurnRate 22 -> 50
- RotateOnSpot = True

Fixed The Pathfinding & Improved the Micro on Wraith (This allows the guns to move more freely)

*** Factories
T2 Engineers can now build T2 Factories T3 Engineers can now build T3 Factories

*** T2 Pillar Tank
Health 1250 -> 1500

*** Misc
Removed Stun from Dalek, Thug, Anode, Hippo, Ambush Bot

Removed Notha & Vesinee

Fixed DPS & Damage on The T4 PD "Neolith"

Reverted Damage nerf to the T4 PD "Mothra"

** 1.31
*** Shield Overspill

- DISCLAIMER: This significantly nerfs shields and SIGNIFICANTLY &
  FUNDAMENTALLY changes the entire flow of the game. It can not be
  stressed enough that when playing 1.31 please take this into account.

Shield Overspill is a brand new functionality for the QUIET Project (although
FAF has had it for a long time). It introduces the ability for Weapons with AoE
to spread the damage out through multiple shields. This effectively nerfs Mobile
Shield Stacking, Static Shield Stacking & makes (T2, T3, T4) Artillery as well
as any unit that wields a significant weapon with large AoE a massive threat to
layered shielding.

Currently AoE Damage is spread throughout shields by a 15% per Shield.

*** T3 Seraphim Oteethka

- Stun Duration 1 -> 0.15 (Seconds)
- Stun Radius 1 -> 0.5
- FiringRandomnessWhileMoving 0.5 -> 0.75

*** T2 Cybran Hoptile
Removed Stun from Rockets

** 1.30
*** T3 UEF Helltank
Removed AMPHIBIOUS Removed SUBMERSIBLE
BuildCostEnergy = 15500, -- was 17500
BuildCostMass = 1425, -- was 1725
**** Riot beams
MaxRadius = 14, --was 28
**** Rocket Salvo
from 44 MaxRadius to 42 MaxRadius
**** Railgun
Damage = 875, -- was 750
MaxRadius = 42, -- was 40
RateOfFire = 0.225, -- was 0.3
**** Ravager
Damage = 35, -- was 50
MaxRadius = 16, -- was 36
Health = 2750, -- was 5150
MaxHealth = 2750, -- was 5150

*** T3 UEF Juggernant
Health = 4200, -- was 3150
MaxHealth = 4200, -- was 3150
BuildCostEnergy = 36000, -- was 24000
BuildCostMass = 3250, -- was 1950
**** Gauss cannon
MaxRadius = 32, -- was 39 --
**** Gatling 2x
MaxRadius = 28, -- was 30

*** T2 Cybran Mobile Bomb

It receives permanent cloak but has it's stealth removed It can not be manually
attacked into the target and will also cause 1.1k dmg if killed (volatile
ability)

*** T4 Cybran Basilisk

Basilisk receives a doubled veterancy level increase to account for its
extremely powerful AA capability.

