changelog/changelog.html
<div id="outline-container-org70790de" class="outline-2">
<h2 id="org70790de">1.34</h2>
<div class="outline-text-2" id="text-org70790de">
</div>
<div id="outline-container-orgde88096" class="outline-3">
<h3 id="orgde88096">No More Roaming</h3>
<div class="outline-text-3" id="text-orgde88096">
<p>
Removed Roaming Behavior From All Experimentals
</p>
</div>
</div>
<div id="outline-container-orgf0a1fa0" class="outline-3">
<h3 id="orgf0a1fa0">Shields</h3>
<div class="outline-text-3" id="text-orgf0a1fa0">
<p>
General Info on shields is that they will take longer to regenerate, many stats
have been standardized then redistributed to give a bit more diversity to the
shields.
</p>

<p>
Integrated Shields received a bit of a hard bonking as their stats were not
justified by the current cost. They were all given 20k+ E Cost and around
500-1000 Mass Cost as well as given the regeneration nerfs and etc.
</p>

<p>
Shields offset were standardized a bit to prevent some of the outrageous shield
layering. (Anti Artillery Shield for UEF is untouched by any of these changes as
well as Cybran Shields inbetween the final &amp; first upgrade)
</p>

<p>
All Square Shields have been removed and replaced by significantly buffed
BrewLAN Experimental Shields that have been completely reworked to fit into the
Experimental Phase of the game.
</p>
</div>
</div>

<div id="outline-container-org51a677f" class="outline-3">
<h3 id="org51a677f">T2 Cybran Hoplite</h3>
<div class="outline-text-3" id="text-org51a677f">
<p>
Range 42 -&gt; 37
</p>
</div>
</div>

<div id="outline-container-orgd3ddd62" class="outline-3">
<h3 id="orgd3ddd62">T2 UEF Mongoose</h3>
<div class="outline-text-3" id="text-orgd3ddd62">
<p>
Range 34 -&gt; 32
</p>
</div>
</div>

<div id="outline-container-orgbdff79e" class="outline-3">
<h3 id="orgbdff79e">T3 Pervical | Brick | Harbinger</h3>
<div class="outline-text-3" id="text-orgbdff79e">
<p>
TurretYawSpeed 35 -&gt; 90
</p>
</div>
</div>

<div id="outline-container-orgddf13ce" class="outline-3">
<h3 id="orgddf13ce">T3 UEF Pervical</h3>
<div class="outline-text-3" id="text-orgddf13ce">
<p>
Damage 900 -&gt; 1450 RoF 0.5 -&gt; 0.23
</p>
</div>
</div>

<div id="outline-container-org17ed985" class="outline-3">
<h3 id="org17ed985">T3 Aeon Harbinger</h3>
<div class="outline-text-3" id="text-org17ed985">
<p>
No Longer Fires two shoots in one Salvo RoF increased to 2 (2 Shoots 2
Salvos)
</p>
</div>
</div>

<div id="outline-container-orgd4bfd93" class="outline-3">
<h3 id="orgd4bfd93">T3 Seraphim Thau Battery</h3>
<div class="outline-text-3" id="text-orgd4bfd93">
<p>
-20% Reduction Against Shields Removed DamageRadius 2 -&gt; 3.5
</p>
</div>
</div>

<div id="outline-container-org3c1a8e4" class="outline-3">
<h3 id="org3c1a8e4">T4 Cybran Megalith</h3>
<div class="outline-text-3" id="text-org3c1a8e4">
<p>
Energy Cost 450000 -&gt; 785500
</p>
</div>
</div>

<div id="outline-container-orgee0beb9" class="outline-3">
<h3 id="orgee0beb9">Misc</h3>
<div class="outline-text-3" id="text-orgee0beb9">
<p>
Removed Cybran T3 Sniper
</p>
</div>
</div>
</div>

<div id="outline-container-orgffcd4d9" class="outline-2">
<h2 id="orgffcd4d9">1.33</h2>
<div class="outline-text-2" id="text-orgffcd4d9">
</div>
<div id="outline-container-orgf54df65" class="outline-3">
<h3 id="orgf54df65">Weapon States</h3>
<div class="outline-text-3" id="text-orgf54df65">
<p>
All Weapon States (Excluding WeaponFiringState) have been rewritten to a
cleaner standard and to reduce the amount of unnessacry states many
units were going through. This causes latency and delay as well as other
strange bugs in units. This is a extremely deep and fundamental change
to the game and I expect some units to be broken. (Please report them in
our discord ASAP for hotfixes)
</p>
</div>
</div>

<div id="outline-container-orgcd13fb0" class="outline-3">
<h3 id="orgcd13fb0">Misc</h3>
<div class="outline-text-3" id="text-orgcd13fb0">
<p>
Fix T2 UEF Statue rockets
</p>

<p>
Fix T2 UEF Pillar DPS
</p>

<p>
Fix T3 Aeon Wraith Pathfinding
</p>

<p>
Fix T3 Cybran Tripple Threat DPS &amp; Firing States
</p>

<p>
Fix T3 UEF Brimstone DPS &amp; Firing States
</p>

<p>
Fix T3 Aeon Mothra DPS &amp; Firing States
</p>

<p>
Fix T3 Cybran Neolith DPS &amp; Firing States
</p>

<p>
Fix Seraphim Commander not shooting the correct projectile
</p>
</div>
</div>
</div>

<div id="outline-container-orgc64bbfa" class="outline-2">
<h2 id="orgc64bbfa">1.32</h2>
<div class="outline-text-2" id="text-orgc64bbfa">
</div>
<div id="outline-container-org565384e" class="outline-3">
<h3 id="org565384e">Wraith</h3>
<div class="outline-text-3" id="text-org565384e">
<ul class="org-ul">
<li>Acceleration 1.5 -&gt; 2</li>
<li>BackUpDistance = 10</li>
<li>TurnFacingRate 20 -&gt; 55</li>
<li>TurnRate 22 -&gt; 50</li>
<li>RotateOnSpot = True</li>
</ul>

<p>
Fixed The Pathfinding &amp; Improved the Micro on Wraith (This allows the guns to move more freely)
</p>
</div>
</div>

<div id="outline-container-org5e64cc4" class="outline-3">
<h3 id="org5e64cc4">Factories</h3>
<div class="outline-text-3" id="text-org5e64cc4">
<p>
T2 Engineers can now build T2 Factories T3 Engineers can now build T3 Factories
</p>
</div>
</div>

<div id="outline-container-org1dfb17d" class="outline-3">
<h3 id="org1dfb17d">T2 Pillar Tank</h3>
<div class="outline-text-3" id="text-org1dfb17d">
<p>
Health 1250 -&gt; 1500
</p>
</div>
</div>

<div id="outline-container-org782caff" class="outline-3">
<h3 id="org782caff">Misc</h3>
<div class="outline-text-3" id="text-org782caff">
<p>
Removed Stun from Dalek, Thug, Anode, Hippo, Ambush Bot
</p>

<p>
Removed Notha &amp; Vesinee
</p>

<p>
Fixed DPS &amp; Damage on The T4 PD "Neolith"
</p>

<p>
Reverted Damage nerf to the T4 PD "Mothra"
</p>
</div>
</div>
</div>

<div id="outline-container-org55a21d8" class="outline-2">
<h2 id="org55a21d8">1.31</h2>
<div class="outline-text-2" id="text-org55a21d8">
</div>
<div id="outline-container-org4f50f7d" class="outline-3">
<h3 id="org4f50f7d">Shield Overspill</h3>
<div class="outline-text-3" id="text-org4f50f7d">
<ul class="org-ul">
<li>DISCLAIMER: This significantly nerfs shields and SIGNIFICANTLY &amp;
FUNDAMENTALLY changes the entire flow of the game. It can not be
stressed enough that when playing 1.31 please take this into account.</li>
</ul>

<p>
Shield Overspill is a brand new functionality for the QUIET Project (although
FAF has had it for a long time). It introduces the ability for Weapons with AoE
to spread the damage out through multiple shields. This effectively nerfs Mobile
Shield Stacking, Static Shield Stacking &amp; makes (T2, T3, T4) Artillery as well
as any unit that wields a significant weapon with large AoE a massive threat to
layered shielding.
</p>

<p>
Currently AoE Damage is spread throughout shields by a 15% per Shield.
</p>
</div>
</div>

<div id="outline-container-org4bd4ce8" class="outline-3">
<h3 id="org4bd4ce8">T3 Seraphim Oteethka</h3>
<div class="outline-text-3" id="text-org4bd4ce8">
<ul class="org-ul">
<li>Stun Duration 1 -&gt; 0.15 (Seconds)</li>
<li>Stun Radius 1 -&gt; 0.5</li>
<li>FiringRandomnessWhileMoving 0.5 -&gt; 0.75</li>
</ul>
</div>
</div>

<div id="outline-container-org2a84cb5" class="outline-3">
<h3 id="org2a84cb5">T2 Cybran Hoptile</h3>
<div class="outline-text-3" id="text-org2a84cb5">
<p>
Removed Stun from Rockets
</p>
</div>
</div>
</div>

<div id="outline-container-org1c24133" class="outline-2">
<h2 id="org1c24133">1.30</h2>
<div class="outline-text-2" id="text-org1c24133">
</div>
<div id="outline-container-org9c5002b" class="outline-3">
<h3 id="org9c5002b">T3 UEF Helltank</h3>
<div class="outline-text-3" id="text-org9c5002b">
<p>
Removed AMPHIBIOUS Removed SUBMERSIBLE
BuildCostEnergy = 15500, &#x2013; was 17500
BuildCostMass = 1425, &#x2013; was 1725
</p>
</div>
<div id="outline-container-org97bc4a1" class="outline-4">
<h4 id="org97bc4a1">Riot beams</h4>
<div class="outline-text-4" id="text-org97bc4a1">
<p>
MaxRadius = 14, &#x2013;was 28
</p>
</div>
</div>
<div id="outline-container-orgd31c13e" class="outline-4">
<h4 id="orgd31c13e">Rocket Salvo</h4>
<div class="outline-text-4" id="text-orgd31c13e">
<p>
from 44 MaxRadius to 42 MaxRadius
</p>
</div>
</div>
<div id="outline-container-org2d885cf" class="outline-4">
<h4 id="org2d885cf">Railgun</h4>
<div class="outline-text-4" id="text-org2d885cf">
<p>
Damage = 875, &#x2013; was 750
MaxRadius = 42, &#x2013; was 40
RateOfFire = 0.225, &#x2013; was 0.3
</p>
</div>
</div>
<div id="outline-container-org3146e16" class="outline-4">
<h4 id="org3146e16">Ravager</h4>
<div class="outline-text-4" id="text-org3146e16">
<p>
Damage = 35, &#x2013; was 50
MaxRadius = 16, &#x2013; was 36
Health = 2750, &#x2013; was 5150
MaxHealth = 2750, &#x2013; was 5150
</p>
</div>
</div>
</div>

<div id="outline-container-org8261924" class="outline-3">
<h3 id="org8261924">T3 UEF Juggernant</h3>
<div class="outline-text-3" id="text-org8261924">
<p>
Health = 4200, &#x2013; was 3150
MaxHealth = 4200, &#x2013; was 3150
BuildCostEnergy = 36000, &#x2013; was 24000
BuildCostMass = 3250, &#x2013; was 1950
</p>
</div>
<div id="outline-container-orgc9e0c04" class="outline-4">
<h4 id="orgc9e0c04">Gauss cannon</h4>
<div class="outline-text-4" id="text-orgc9e0c04">
<p>
MaxRadius = 32, &#x2013; was 39 &#x2013;
</p>
</div>
</div>
<div id="outline-container-org1ea4e5b" class="outline-4">
<h4 id="org1ea4e5b">Gatling 2x</h4>
<div class="outline-text-4" id="text-org1ea4e5b">
<p>
MaxRadius = 28, &#x2013; was 30
</p>
</div>
</div>
</div>

<div id="outline-container-org853a84d" class="outline-3">
<h3 id="org853a84d">T2 Cybran Mobile Bomb</h3>
<div class="outline-text-3" id="text-org853a84d">
<p>
It receives permanent cloak but has it's stealth removed It can not be manually
attacked into the target and will also cause 1.1k dmg if killed (volatile
ability)
</p>
</div>
</div>

<div id="outline-container-org2972b2f" class="outline-3">
<h3 id="org2972b2f">T4 Cybran Basilisk</h3>
<div class="outline-text-3" id="text-org2972b2f">
<p>
Basilisk receives a doubled veterancy level increase to account for its
extremely powerful AA capability.
</p>
</div>
</div>
