changelog/changelog.org
*** ACU Overcharge Rework:

ACU Overcharge rework applies to all Commanders are a standardized
number system.

- commandDamage = 400
- energyMult = 0.9
- maxDamage = 25000
- minDamage = 1250
- structureDamage = 800

This is the number table for all Commanders, CommandDamage and
StructureDamage are unique hard values for all (Commanders & Structures)
Damage is calculated base off the Energy aviable in your storage and can
use up to 90% of your energy storage.

The maxDamage it can deliver is 25000 however this takes significant amount of
storage (the calculated value would be somewhere around 70k e storage) The
cooldown is rapid however takes around 3 seconds for a full recharge of the OC
once used. -> EnergyDrainPerSecond = 1500, -> EnergyRequired = 4500,

With around 20k e storage, your commander can now easily demolish his
way through a T3.5 Army especially if he's a fully combat vetted and
upgrade Commander. He will still struggle with Experimentals as the peak
damage is VERY hard to reach.

*** Removed Units

T3 UEF Ironfist

** 1.29

*** T2 Seraphim Ilsavoh & T2.5 Ilsavoh

YawSpeed increased from 30 -> 90 or 75 (t2.5)

*** T2 UEF Rommel

Rommel Tech 3 -> Tech 2 All Stats generally taken from the T2 Banshee

*** T4 Mothra

Damage 2950 -> 1475 DamageRadius 2.5 -> 2 Range 100 -> 88

*** Unit Removal

UEF: T2 Janus, T3 Warhammer, T4 Rampage, T2 Banshee Cybran: T2 Cosair
All: Experimental Resource Storages

UEF Pillar / Cybran Hoplite / UEF Mongoose TurretYawSpeed from 45 -> 90

*** T2 Cybran Ambush Unit

Removed Stealth Cloaking is always on now

- Health 900 -> 1000
- RegenRate 1 -> 7.5
- Range increased to 30 from 28

*** T2.5 UEF Land Unit

FiringRandomness 0.3 -> 0 (Guass Weapons)
FiringRandomnessWhenMoving 0.9 -> 0.35 (Guass Weapons)
FiringRandomness 0.3 -> 0 (Gatling Weapons)
MuzzleVelocity 29 -> 30
TurretYawSpeed 45 -> 60 (Gatling Weapons)

*** T1.5 Land Units

All speed reduced from 3.1-3.4 to a generalized 2.65-2.7 MaxSpeed

Acceleration reduced from 1.5 to 1.15 in most cases (this is also generalized)

T1.5 Aeon Unit receives a rocket range reduction from 34 to 28

T1.5 UEF Unit receives 1 DamageRadius & range standardized with other T1.5 units
as it's speed is standardized now.

*** Misc
Athusil Hitbox is fixed so Laser Units don't miss

Mongoose Snap Behavior and Gatling Gun sometimes locking up completely is now fixed

Slink Cloak now fully works and does not require you to reenable it after it
fires

** 1.28
*** T1 Shard AA Boat
Shard receives a significant 20 -> 12.5 DPS Nerf as well as AoE
Reduction from 2 -> 1.25 to stop it from dominating T2 Torpedo Bombers
via spam.

*** T2 Submarine Hunters
Projectile Count Reduced from 3 -> 1
Damage reduced by 50%
SalvoDelay increase to 1 Second on all T2 Submarines
Torpedo Defense on Submarine Hunters from 9 -> 23 RoF
Torpedo Defense Range on Submarine Hunters from 3.2 -> 3.3

*** T2 Destroyers
T2 Destroyers receive another Torpedo Defense Buff to combat submarines

*** Air Overhaul

Air Overhaul introduces many fixes to physics of Bombers &
Rebalancing of Fighters to make T2 Fighters relevant and T1 Fighters far
less effective.

T1 Air Fighters: 20 HP Reduction 5-10% DPS Reduction

T2 Air Fighters: 50% Increase in Dps 3k E Cost Reduction 30 M Cost
Reduction

Health: 1300 - 1500 (Depending on Faction)

Misc: All Bombers physics reworked to allow them to properly be micro'd and
bombs dropped significantly better

** 9/15/24
*** T3 Seraphim Submarine
Slight Nerf to Seraphim Submarine to prevent the meta where you would
shift g 5-6 seraphim subs on top of each other and their torp defense
would infinitely be able to defend a SIGNIFICANT amount of torps.

*** T2 Destroyers
All Torpedo Defense on Destroyers significantly buffed should be able to crush
T1 Subs at a relative similar cost efficiency

*** T2 Torpedo Bombers
Torpedo Bombers nerfed to original 800-860 Health Values with a slight increase
in E cost & M cost. Relative Cost increase was 2k more e and 50 more mass

*** Bombers
Fixed Bombers not dropping bombs properly also nerfs dodge micro against
bombers as well, i.e means early bombers and such are much stronger and
harder to dodge

*** T2 Static Flak & T3 Static Flak
Buff Flak against Gunships & Remove most of it's usefulness against fast flying
strategic bombers and fighters (Making sams more useful) Comparable Values to
the Static except higher rank and generally more damage (although of course more
cost)

*** T2 Cybran Immortal
Cybran should NOT be receiving Stealth or Cloak on 99% of their units as they
have powerful mobile stealth & cloaking fields in both T2 & T3 Removed Stealth

*** Misc

Fix Target Priorities for certain units. They will target Protector Bots
properly again.

Evenflow is now integrated into Economy & Flow.It is
now strongly recommended to use this version as it goes hand and hand
with QCE.

Additional tweaks into Economy & Flow include Hydrocarbons put into line with T2
Pgen & T3 Pgen cost and production of energy.

Another Additional tweak includes reduction in buildtime on the Enhancements on
T3 Factories Fixed T3 Seraphim SAM Missing ASF & Strategic Bombers Fixed Czar
never catching up to a target when using an attack command

** 9/14/2024

*** Aeon T2 Sniper
Reload Speed 6 -> 7 Seconds Removed Stealth MaxSpeed 3.8 -> 3.6

*** T2 Mobile Flak
Buff Flak against Gunships & Remove most of it's usefulness against
fast flying strategic bombers and fighters (Making sams more useful)

All Flak: Normalize Speed to Allow Micro'ing
- DamageRadius: 1.5 -> 3
- TurretYaw: 360 -> 180 TurretYawSpeed: (A: 45 | C: 30 | U: 60 | S: 40)
- Muzzle Velocity: 48 -> 20
- FiringRandomness: 0.5 -> 2.5
- MaxRadius: 36 -> 40

Significant Buff to TargetPriorities

