changelog/changelog.html

<div id="outline-container-orgb362dec" class="outline-3">
<h3 id="orgb362dec">ACU Overcharge Rework:</h3>
<div class="outline-text-3" id="text-orgb362dec">
<p>
ACU Overcharge rework applies to all Commanders are a standardized
number system.
</p>

<ul class="org-ul">
<li>commandDamage = 400</li>
<li>energyMult = 0.9</li>
<li>maxDamage = 25000</li>
<li>minDamage = 1250</li>
<li>structureDamage = 800</li>
</ul>

<p>
This is the number table for all Commanders, CommandDamage and
StructureDamage are unique hard values for all (Commanders &amp; Structures)
Damage is calculated base off the Energy aviable in your storage and can
use up to 90% of your energy storage.
</p>

<p>
The maxDamage it can deliver is 25000 however this takes significant amount of
storage (the calculated value would be somewhere around 70k e storage) The
cooldown is rapid however takes around 3 seconds for a full recharge of the OC
once used. -&gt; EnergyDrainPerSecond = 1500, -&gt; EnergyRequired = 4500,
</p>

<p>
With around 20k e storage, your commander can now easily demolish his
way through a T3.5 Army especially if he's a fully combat vetted and
upgrade Commander. He will still struggle with Experimentals as the peak
damage is VERY hard to reach.
</p>
</div>
</div>

<div id="outline-container-orged20355" class="outline-3">
<h3 id="orged20355">Removed Units</h3>
<div class="outline-text-3" id="text-orged20355">
<p>
T3 UEF Ironfist
</p>
</div>
</div>
</div>

<div id="outline-container-org13ef4e2" class="outline-2">
<h2 id="org13ef4e2">1.29</h2>
<div class="outline-text-2" id="text-org13ef4e2">
</div>
<div id="outline-container-org6a5f757" class="outline-3">
<h3 id="org6a5f757">T2 Seraphim Ilsavoh &amp; T2.5 Ilsavoh</h3>
<div class="outline-text-3" id="text-org6a5f757">
<p>
YawSpeed increased from 30 -&gt; 90 or 75 (t2.5)
</p>
</div>
</div>

<div id="outline-container-org310e8b9" class="outline-3">
<h3 id="org310e8b9">T2 UEF Rommel</h3>
<div class="outline-text-3" id="text-org310e8b9">
<p>
Rommel Tech 3 -&gt; Tech 2 All Stats generally taken from the T2 Banshee
</p>
</div>
</div>

<div id="outline-container-orgd00a403" class="outline-3">
<h3 id="orgd00a403">T4 Mothra</h3>
<div class="outline-text-3" id="text-orgd00a403">
<p>
Damage 2950 -&gt; 1475 DamageRadius 2.5 -&gt; 2 Range 100 -&gt; 88
</p>
</div>
</div>

<div id="outline-container-org23f9b69" class="outline-3">
<h3 id="org23f9b69">Unit Removal</h3>
<div class="outline-text-3" id="text-org23f9b69">
<p>
UEF: T2 Janus, T3 Warhammer, T4 Rampage, T2 Banshee Cybran: T2 Cosair
All: Experimental Resource Storages
</p>

<p>
UEF Pillar / Cybran Hoplite / UEF Mongoose TurretYawSpeed from 45 -&gt; 90
</p>
</div>
</div>

<div id="outline-container-org5e6e530" class="outline-3">
<h3 id="org5e6e530">T2 Cybran Ambush Unit</h3>
<div class="outline-text-3" id="text-org5e6e530">
<p>
Removed Stealth Cloaking is always on now
</p>

<ul class="org-ul">
<li>Health 900 -&gt; 1000</li>
<li>RegenRate 1 -&gt; 7.5</li>
<li>Range increased to 30 from 28</li>
</ul>
</div>
</div>

<div id="outline-container-orga582908" class="outline-3">
<h3 id="orga582908">T2.5 UEF Land Unit</h3>
<div class="outline-text-3" id="text-orga582908">
<p>
FiringRandomness 0.3 -&gt; 0 (Guass Weapons)
FiringRandomnessWhenMoving 0.9 -&gt; 0.35 (Guass Weapons)
FiringRandomness 0.3 -&gt; 0 (Gatling Weapons)
MuzzleVelocity 29 -&gt; 30
TurretYawSpeed 45 -&gt; 60 (Gatling Weapons)
</p>
</div>
</div>

<div id="outline-container-org320f3a0" class="outline-3">
<h3 id="org320f3a0">T1.5 Land Units</h3>
<div class="outline-text-3" id="text-org320f3a0">
<p>
All speed reduced from 3.1-3.4 to a generalized 2.65-2.7 MaxSpeed
</p>

<p>
Acceleration reduced from 1.5 to 1.15 in most cases (this is also generalized)
</p>

<p>
T1.5 Aeon Unit receives a rocket range reduction from 34 to 28
</p>

<p>
T1.5 UEF Unit receives 1 DamageRadius &amp; range standardized with other T1.5 units
as it's speed is standardized now.
</p>
</div>
</div>

<div id="outline-container-org2451f26" class="outline-3">
<h3 id="org2451f26">Misc</h3>
<div class="outline-text-3" id="text-org2451f26">
<p>
Athusil Hitbox is fixed so Laser Units don't miss
</p>

<p>
Mongoose Snap Behavior and Gatling Gun sometimes locking up completely is now fixed
</p>

<p>
Slink Cloak now fully works and does not require you to reenable it after it
fires
</p>
</div>
</div>
</div>

<div id="outline-container-orgcc28750" class="outline-2">
<h2 id="orgcc28750">1.28</h2>
<div class="outline-text-2" id="text-orgcc28750">
</div>
<div id="outline-container-org3f556e0" class="outline-3">
<h3 id="org3f556e0">T1 Shard AA Boat</h3>
<div class="outline-text-3" id="text-org3f556e0">
<p>
Shard receives a significant 20 -&gt; 12.5 DPS Nerf as well as AoE
Reduction from 2 -&gt; 1.25 to stop it from dominating T2 Torpedo Bombers
via spam.
</p>
</div>
</div>

<div id="outline-container-org5da89a1" class="outline-3">
<h3 id="org5da89a1">T2 Submarine Hunters</h3>
<div class="outline-text-3" id="text-org5da89a1">
<p>
Projectile Count Reduced from 3 -&gt; 1
Damage reduced by 50%
SalvoDelay increase to 1 Second on all T2 Submarines
Torpedo Defense on Submarine Hunters from 9 -&gt; 23 RoF
Torpedo Defense Range on Submarine Hunters from 3.2 -&gt; 3.3
</p>
</div>
</div>

<div id="outline-container-org806936c" class="outline-3">
<h3 id="org806936c">T2 Destroyers</h3>
<div class="outline-text-3" id="text-org806936c">
<p>
T2 Destroyers receive another Torpedo Defense Buff to combat submarines
</p>
</div>
</div>

<div id="outline-container-org9b1cbae" class="outline-3">
<h3 id="org9b1cbae">Air Overhaul</h3>
<div class="outline-text-3" id="text-org9b1cbae">
<p>
Air Overhaul introduces many fixes to physics of Bombers &amp;
Rebalancing of Fighters to make T2 Fighters relevant and T1 Fighters far
less effective.
</p>

<p>
T1 Air Fighters: 20 HP Reduction 5-10% DPS Reduction
</p>

<p>
T2 Air Fighters: 50% Increase in Dps 3k E Cost Reduction 30 M Cost
Reduction
</p>

<p>
Health: 1300 - 1500 (Depending on Faction)
</p>

<p>
Misc: All Bombers physics reworked to allow them to properly be micro'd and
bombs dropped significantly better
</p>
</div>
</div>
</div>

<div id="outline-container-org0c5aca7" class="outline-2">
<h2 id="org0c5aca7">9/15/24</h2>
<div class="outline-text-2" id="text-org0c5aca7">
</div>
<div id="outline-container-org1082478" class="outline-3">
<h3 id="org1082478">T3 Seraphim Submarine</h3>
<div class="outline-text-3" id="text-org1082478">
<p>
Slight Nerf to Seraphim Submarine to prevent the meta where you would
shift g 5-6 seraphim subs on top of each other and their torp defense
would infinitely be able to defend a SIGNIFICANT amount of torps.
</p>
</div>
</div>

<div id="outline-container-orge21bb9e" class="outline-3">
<h3 id="orge21bb9e">T2 Destroyers</h3>
<div class="outline-text-3" id="text-orge21bb9e">
<p>
All Torpedo Defense on Destroyers significantly buffed should be able to crush
T1 Subs at a relative similar cost efficiency
</p>
</div>
</div>

<div id="outline-container-org0042251" class="outline-3">
<h3 id="org0042251">T2 Torpedo Bombers</h3>
<div class="outline-text-3" id="text-org0042251">
<p>
Torpedo Bombers nerfed to original 800-860 Health Values with a slight increase
in E cost &amp; M cost. Relative Cost increase was 2k more e and 50 more mass
</p>
</div>
</div>

<div id="outline-container-org555742f" class="outline-3">
<h3 id="org555742f">Bombers</h3>
<div class="outline-text-3" id="text-org555742f">
<p>
Fixed Bombers not dropping bombs properly also nerfs dodge micro against
bombers as well, i.e means early bombers and such are much stronger and
harder to dodge
</p>
</div>
</div>

<div id="outline-container-org5435548" class="outline-3">
<h3 id="org5435548">T2 Static Flak &amp; T3 Static Flak</h3>
<div class="outline-text-3" id="text-org5435548">
<p>
Buff Flak against Gunships &amp; Remove most of it's usefulness against fast flying
strategic bombers and fighters (Making sams more useful) Comparable Values to
the Static except higher rank and generally more damage (although of course more
cost)
</p>
</div>
</div>

<div id="outline-container-org5dd36c1" class="outline-3">
<h3 id="org5dd36c1">T2 Cybran Immortal</h3>
<div class="outline-text-3" id="text-org5dd36c1">
<p>
Cybran should NOT be receiving Stealth or Cloak on 99% of their units as they
have powerful mobile stealth &amp; cloaking fields in both T2 &amp; T3 Removed Stealth
</p>
</div>
</div>

<div id="outline-container-org69f1342" class="outline-3">
<h3 id="org69f1342">Misc</h3>
<div class="outline-text-3" id="text-org69f1342">
<p>
Fix Target Priorities for certain units. They will target Protector Bots
properly again.
</p>

<p>
Evenflow is now integrated into Economy &amp; Flow.It is
now strongly recommended to use this version as it goes hand and hand
with QCE.
</p>

<p>
Additional tweaks into Economy &amp; Flow include Hydrocarbons put into line with T2
Pgen &amp; T3 Pgen cost and production of energy.
</p>

<p>
Another Additional tweak includes reduction in buildtime on the Enhancements on
T3 Factories Fixed T3 Seraphim SAM Missing ASF &amp; Strategic Bombers Fixed Czar
never catching up to a target when using an attack command
</p>
</div>
</div>
</div>

<div id="outline-container-orgf8d5bd5" class="outline-2">
<h2 id="orgf8d5bd5">9/14/2024</h2>
<div class="outline-text-2" id="text-orgf8d5bd5">
</div>
<div id="outline-container-org1f7ec0e" class="outline-3">
<h3 id="org1f7ec0e">Aeon T2 Sniper</h3>
<div class="outline-text-3" id="text-org1f7ec0e">
<p>
Reload Speed 6 -&gt; 7 Seconds Removed Stealth MaxSpeed 3.8 -&gt; 3.6
</p>
</div>
</div>

<div id="outline-container-orgc1b4237" class="outline-3">
<h3 id="orgc1b4237">T2 Mobile Flak</h3>
<div class="outline-text-3" id="text-orgc1b4237">
<p>
Buff Flak against Gunships &amp; Remove most of it's usefulness against
fast flying strategic bombers and fighters (Making sams more useful)
</p>

<p>
All Flak: Normalize Speed to Allow Micro'ing
</p>
<ul class="org-ul">
<li>DamageRadius: 1.5 -&gt; 3</li>
<li>TurretYaw: 360 -&gt; 180 TurretYawSpeed: (A: 45 | C: 30 | U: 60 | S: 40)</li>
<li>Muzzle Velocity: 48 -&gt; 20</li>
<li>FiringRandomness: 0.5 -&gt; 2.5</li>
<li>MaxRadius: 36 -&gt; 40</li>
</ul>

<p>
Significant Buff to TargetPriorities
</p>
</div>
</div>
