changelog/changelog.org
*** T3 Sniper
Snipers are all now more nimble to allow micro & also to allow them
to be relevant especially in QUIET where there is a lot more Indirect
then Vanilla or FAF (Might still need more buffs)

- Normalize Speed to Allow Micro'ing
- Significant Buff to TargetPriorities
- DamageType = 'ShieldMult1.2', (20% Shield Damage)
- FiringTolerance: 0.1 -> 2
**** Aeon:
  - ReloadSpeed: 9 -> 6 Seconds
  - TurretYaw: 360 -> 180
  - TurretYawSpeed: 30 -> 90
  - Removed Unpacking Animation
**** Seraphim:
  - SniperMode FiringTolerance: 0.1 -> 3
  - ReloadSpeed: 19 -> 10 Seconds
  - TurretYaw: 360 -> 180
  - TurretYawSpeed: 30 -> 90

** 9/12/2024
*** UEF T4 Goliath

Significant Buff to TargetPriorities Forced the Goliath to turn with
it's weapons when not being moved commanded Reclassed to Breacher Class

Added Effects to its Missile Barrage

- Health 104000 -> 124000
  
**** Missile Barrage:
   - Firing Randomness 3 -> 5
   - Damage 600 -> 1000
   - DamageRadius 3 -> 4
   - ProjectileLifetimeUsesMultiplier = 1

Missiles now ZigZag and create a random scatter barrage meaning the missiles no
longer all hit the targetground perfectly. (This makes it extremely hard for TMD
to intercept them)

   - Missile Health 1 -> 2
   - MaxSpeed 20 -> 10
**** Flamethrower Arms:
   - DPS: 480 DPS -> 880 DPS
**** Death Nuke:
   - Damage 14,700 -> 32,890
   - InnerRadius 12 -> 18
   - OuterRadius 24 -> 38

** 9/10/2024

Fixed Barrage Artillery not being correctly modified Added Submod called
"Economy & Flow" will be added to modlist when you add the full LCE to
your usermods folder. Economy & Flow affects factories cost, mass
extractor income & cost and will eventually include a custom version of
Evenflow. Removed AirSpawnWaves from all AIs in LOUD

** 1.22
- 9/8/2024
*** Reclaim
Reclaim that contains 90% of it's mass or higher is reduced to 75%
however if the reclaim is lower then 75% on a unit's wreckage it is
brought back up to 75%

*** T1 & T2 Land
T1 & T2 were overperforming especially T1 Land against both T2 & T3,
similarly T2 was overperforming vs T3.

The intended purpose of this change is to extend the gap between tiers.

Removed 12% Speed & Health Buff given to T1 Land in Blueprints.lua

Removed 6% Speed & Health Buff given to T2 Land in Blueprints.lua

*** T3 Barrage Artillery

Barrage Artillery is buffed to make it more cost efficient vs
building additional T2 Artillery.

Redid TargetPriorities for All T3 Barrage.

**** Aeon:
 - Damage 265 -> 530
 - DamageRadius 2 -> 3
**** UEF:
 - Damage 1500 -> 3000
 - DamageRadius 2 -> 3
**** Cybran:
 - Damage 1200 -> 2400
 - DamageRadius 2.8 -> 3.8
 - StunRadius 2 -> 3
**** Seraphim:
 - Damage 1300 -> 2600
 - Damage Radius 2.4 -> 3.4
 - DamageType Normal -> ShieldMult1.5 (50% More Damage to Shields)
 - Muzzle Velocity 33 -> 66

*** T4 Eliash Medium Rapid Assault Bot
The Eliash receives a small buff to it's personal shield Shield
 - 21000 -> 26000
 -  ShieldRegenStartTime 1 -> 0.5
**  1.02/1.021
- 9/3/2024
*** T3 Triseptitron
Rocket Damage 125 -> 215

Range 80 -> 90

DamageRadius 2 -> 2.5

FiringRandomness 1.4 -> 4

Fixed issue where it was overshooting it's target always

*** T4 Galactic Colossus (GC) / T4 Universal Colossus (UC)
- Fixed GC/UC Tractor Claws (This makes them SIGNIFICANTLY more powerful)
- GC/UC Tractor Claws now crush units over time that have a health over
5000
- UC Tractor Claws deal 9999 every 11 Ticks
- GC Tractor Claws deal 4999 every 11 Ticks

*** T4 Eliash Medium Rapid Assault Bot
Mass Cost 26000 -> 21000

Energy Cost 420000 -> 480000

Health 66500 -> 18500

Shield = 21000

ShieldRegenRate = 240

ShieldRechargeTime = 12

**** Main Weapon
Buffed Auto TargetPriorities

10000 -> 5000 DPS

EnergyDrainPerSecond = 650

EnergyRequired = 3250
AA Weapon 300 -> 400 Damage

*** T2 Aeon Sniper
TargetPriorities Readjusted to increase Micro Focus Remove Shield

Ignoring from Projectile MaintenanceConsumptionPerSecondEnergy 20 -> 50

** 1.0.1
- 9/2/2024

Hotfix for T2 Aeon Sniper not firing

** 1.0.0
-  9/2/2024
*** Reclaim Changes

Reclaim Changes were simple. The Single Goal in Mind was to encourage
early aggression but punish late game mistakes i.e losing entire army
without delivering significant damage.

All Wrecks have been fixed to prevent permanent disappear of Wreckage/Reclaim
Overkill Ratio on Wreckage disappearing has been changed from 10% to 30% meaning
you have to overkill said unit by 30% to not receive the wreckage Naval Reclaim
no longer gives 30% of the energy in the Wreckage

*** T3 Penetration Bombers

Pen Bombers are very strong, with the ability to easily punch through
most AA & having cheap stealth. This change was needed to prevent early
Pen Bomber Rushes specifically in Teamgames.Many changes are aimed at
some of the first steps towards significantly diversifying units

**** Aeon:
Mass Cost 4300 -> 5300
Energy Cost 165000 -> 195000
Stealth Energy Cost Upkeep 50 -> 250
MaxAirspeed 19 -> 17
MinAirspeed 15 -> 14
TurnSpeed 1.0 -> 1.1
