changelog/changelog.html

<div id="outline-container-org58ef09f" class="outline-3">
<h3 id="org58ef09f">T3 Sniper</h3>
<div class="outline-text-3" id="text-org58ef09f">
<p>
Snipers are all now more nimble to allow micro &amp; also to allow them
to be relevant especially in QUIET where there is a lot more Indirect
then Vanilla or FAF (Might still need more buffs)
</p>

<ul class="org-ul">
<li>Normalize Speed to Allow Micro'ing</li>
<li>Significant Buff to TargetPriorities</li>
<li>DamageType = 'ShieldMult1.2', (20% Shield Damage)</li>
<li>FiringTolerance: 0.1 -&gt; 2</li>
</ul>
</div>
<div id="outline-container-orga55c478" class="outline-4">
<h4 id="orga55c478">Aeon:</h4>
<div class="outline-text-4" id="text-orga55c478">
<ul class="org-ul">
<li>ReloadSpeed: 9 -&gt; 6 Seconds</li>
<li>TurretYaw: 360 -&gt; 180</li>
<li>TurretYawSpeed: 30 -&gt; 90</li>
<li>Removed Unpacking Animation</li>
</ul>
</div>
</div>
<div id="outline-container-org87235c3" class="outline-4">
<h4 id="org87235c3">Seraphim:</h4>
<div class="outline-text-4" id="text-org87235c3">
<ul class="org-ul">
<li>SniperMode FiringTolerance: 0.1 -&gt; 3</li>
<li>ReloadSpeed: 19 -&gt; 10 Seconds</li>
<li>TurretYaw: 360 -&gt; 180</li>
<li>TurretYawSpeed: 30 -&gt; 90</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgff5d9bf" class="outline-2">
<h2 id="orgff5d9bf">9/12/2024</h2>
<div class="outline-text-2" id="text-orgff5d9bf">
</div>
<div id="outline-container-orgeec0b11" class="outline-3">
<h3 id="orgeec0b11">UEF T4 Goliath</h3>
<div class="outline-text-3" id="text-orgeec0b11">
<p>
Significant Buff to TargetPriorities Forced the Goliath to turn with
it's weapons when not being moved commanded Reclassed to Breacher Class
</p>

<p>
Added Effects to its Missile Barrage
</p>

<ul class="org-ul">
<li>Health 104000 -&gt; 124000</li>
</ul>
</div>

<div id="outline-container-org869ec40" class="outline-4">
<h4 id="org869ec40">Missile Barrage:</h4>
<div class="outline-text-4" id="text-org869ec40">
<ul class="org-ul">
<li>Firing Randomness 3 -&gt; 5</li>
<li>Damage 600 -&gt; 1000</li>
<li>DamageRadius 3 -&gt; 4</li>
<li>ProjectileLifetimeUsesMultiplier = 1</li>
</ul>

<p>
Missiles now ZigZag and create a random scatter barrage meaning the missiles no
longer all hit the targetground perfectly. (This makes it extremely hard for TMD
to intercept them)
</p>

<ul class="org-ul">
<li>Missile Health 1 -&gt; 2</li>
<li>MaxSpeed 20 -&gt; 10</li>
</ul>
</div>
</div>
<div id="outline-container-orgb68504a" class="outline-4">
<h4 id="orgb68504a">Flamethrower Arms:</h4>
<div class="outline-text-4" id="text-orgb68504a">
<ul class="org-ul">
<li>DPS: 480 DPS -&gt; 880 DPS</li>
</ul>
</div>
</div>
<div id="outline-container-org93af55a" class="outline-4">
<h4 id="org93af55a">Death Nuke:</h4>
<div class="outline-text-4" id="text-org93af55a">
<ul class="org-ul">
<li>Damage 14,700 -&gt; 32,890</li>
<li>InnerRadius 12 -&gt; 18</li>
<li>OuterRadius 24 -&gt; 38</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfee8efc" class="outline-2">
<h2 id="orgfee8efc">9/10/2024</h2>
<div class="outline-text-2" id="text-orgfee8efc">
<p>
Fixed Barrage Artillery not being correctly modified Added Submod called
"Economy &amp; Flow" will be added to modlist when you add the full LCE to
your usermods folder. Economy &amp; Flow affects factories cost, mass
extractor income &amp; cost and will eventually include a custom version of
Evenflow. Removed AirSpawnWaves from all AIs in LOUD
</p>
</div>
</div>

<div id="outline-container-org4e34f9a" class="outline-2">
<h2 id="org4e34f9a">1.22</h2>
<div class="outline-text-2" id="text-org4e34f9a">
<ul class="org-ul">
<li>9/8/2024</li>
</ul>
</div>
<div id="outline-container-org0e1b778" class="outline-3">
<h3 id="org0e1b778">Reclaim</h3>
<div class="outline-text-3" id="text-org0e1b778">
<p>
Reclaim that contains 90% of it's mass or higher is reduced to 75%
however if the reclaim is lower then 75% on a unit's wreckage it is
brought back up to 75%
</p>
</div>
</div>

<div id="outline-container-org32ca358" class="outline-3">
<h3 id="org32ca358">T1 &amp; T2 Land</h3>
<div class="outline-text-3" id="text-org32ca358">
<p>
T1 &amp; T2 were overperforming especially T1 Land against both T2 &amp; T3,
similarly T2 was overperforming vs T3.
</p>

<p>
The intended purpose of this change is to extend the gap between tiers.
</p>

<p>
Removed 12% Speed &amp; Health Buff given to T1 Land in Blueprints.lua
</p>

<p>
Removed 6% Speed &amp; Health Buff given to T2 Land in Blueprints.lua
</p>
</div>
</div>

<div id="outline-container-orgea8afaa" class="outline-3">
<h3 id="orgea8afaa">T3 Barrage Artillery</h3>
<div class="outline-text-3" id="text-orgea8afaa">
<p>
Barrage Artillery is buffed to make it more cost efficient vs
building additional T2 Artillery.
</p>

<p>
Redid TargetPriorities for All T3 Barrage.
</p>
</div>

<div id="outline-container-org1fc1e5f" class="outline-4">
<h4 id="org1fc1e5f">Aeon:</h4>
<div class="outline-text-4" id="text-org1fc1e5f">
<ul class="org-ul">
<li>Damage 265 -&gt; 530</li>
<li>DamageRadius 2 -&gt; 3</li>
</ul>
</div>
</div>
<div id="outline-container-orge60abb9" class="outline-4">
<h4 id="orge60abb9">UEF:</h4>
<div class="outline-text-4" id="text-orge60abb9">
<ul class="org-ul">
<li>Damage 1500 -&gt; 3000</li>
<li>DamageRadius 2 -&gt; 3</li>
</ul>
</div>
</div>
<div id="outline-container-org812ff48" class="outline-4">
<h4 id="org812ff48">Cybran:</h4>
<div class="outline-text-4" id="text-org812ff48">
<ul class="org-ul">
<li>Damage 1200 -&gt; 2400</li>
<li>DamageRadius 2.8 -&gt; 3.8</li>
<li>StunRadius 2 -&gt; 3</li>
</ul>
</div>
</div>
<div id="outline-container-orgc5c6de2" class="outline-4">
<h4 id="orgc5c6de2">Seraphim:</h4>
<div class="outline-text-4" id="text-orgc5c6de2">
<ul class="org-ul">
<li>Damage 1300 -&gt; 2600</li>
<li>Damage Radius 2.4 -&gt; 3.4</li>
<li>DamageType Normal -&gt; ShieldMult1.5 (50% More Damage to Shields)</li>
<li>Muzzle Velocity 33 -&gt; 66</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org5041717" class="outline-3">
<h3 id="org5041717">T4 Eliash Medium Rapid Assault Bot</h3>
<div class="outline-text-3" id="text-org5041717">
<p>
The Eliash receives a small buff to it's personal shield Shield
</p>
<ul class="org-ul">
<li>21000 -&gt; 26000</li>
<li>ShieldRegenStartTime 1 -&gt; 0.5</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgebdb270" class="outline-2">
<h2 id="orgebdb270">1.02/1.021</h2>
<div class="outline-text-2" id="text-orgebdb270">
<ul class="org-ul">
<li>9/3/2024</li>
</ul>
</div>
<div id="outline-container-org9fd9703" class="outline-3">
<h3 id="org9fd9703">T3 Triseptitron</h3>
<div class="outline-text-3" id="text-org9fd9703">
<p>
Rocket Damage 125 -&gt; 215
</p>

<p>
Range 80 -&gt; 90
</p>

<p>
DamageRadius 2 -&gt; 2.5
</p>

<p>
FiringRandomness 1.4 -&gt; 4
</p>

<p>
Fixed issue where it was overshooting it's target always
</p>
</div>
</div>

<div id="outline-container-orgbc84ac8" class="outline-3">
<h3 id="orgbc84ac8">T4 Galactic Colossus (GC) / T4 Universal Colossus (UC)</h3>
<div class="outline-text-3" id="text-orgbc84ac8">
<ul class="org-ul">
<li>Fixed GC/UC Tractor Claws (This makes them SIGNIFICANTLY more powerful)</li>
<li>GC/UC Tractor Claws now crush units over time that have a health over</li>
</ul>
<p>
5000
</p>
<ul class="org-ul">
<li>UC Tractor Claws deal 9999 every 11 Ticks</li>
<li>GC Tractor Claws deal 4999 every 11 Ticks</li>
</ul>
</div>
</div>

<div id="outline-container-org6a951fb" class="outline-3">
<h3 id="org6a951fb">T4 Eliash Medium Rapid Assault Bot</h3>
<div class="outline-text-3" id="text-org6a951fb">
<p>
Mass Cost 26000 -&gt; 21000
</p>

<p>
Energy Cost 420000 -&gt; 480000
</p>

<p>
Health 66500 -&gt; 18500
</p>

<p>
Shield = 21000
</p>

<p>
ShieldRegenRate = 240
</p>

<p>
ShieldRechargeTime = 12
</p>
</div>

<div id="outline-container-orgdfb952a" class="outline-4">
<h4 id="orgdfb952a">Main Weapon</h4>
<div class="outline-text-4" id="text-orgdfb952a">
<p>
Buffed Auto TargetPriorities
</p>

<p>
10000 -&gt; 5000 DPS
</p>

<p>
EnergyDrainPerSecond = 650
</p>

<p>
EnergyRequired = 3250
AA Weapon 300 -&gt; 400 Damage
</p>
</div>
</div>
</div>

<div id="outline-container-orgcfac0b6" class="outline-3">
<h3 id="orgcfac0b6">T2 Aeon Sniper</h3>
<div class="outline-text-3" id="text-orgcfac0b6">
<p>
TargetPriorities Readjusted to increase Micro Focus Remove Shield
</p>

<p>
Ignoring from Projectile MaintenanceConsumptionPerSecondEnergy 20 -&gt; 50
</p>
</div>
</div>
</div>

<div id="outline-container-org07368e1" class="outline-2">
<h2 id="org07368e1">1.0.1</h2>
<div class="outline-text-2" id="text-org07368e1">
<ul class="org-ul">
<li>9/2/2024</li>
</ul>

<p>
Hotfix for T2 Aeon Sniper not firing
</p>
</div>
</div>

<div id="outline-container-org22a04d3" class="outline-2">
<h2 id="org22a04d3">1.0.0</h2>
<div class="outline-text-2" id="text-org22a04d3">
<ul class="org-ul">
<li>9/2/2024</li>
</ul>
</div>
<div id="outline-container-orga0efd72" class="outline-3">
<h3 id="orga0efd72">Reclaim Changes</h3>
<div class="outline-text-3" id="text-orga0efd72">
<p>
Reclaim Changes were simple. The Single Goal in Mind was to encourage
early aggression but punish late game mistakes i.e losing entire army
without delivering significant damage.
</p>

<p>
All Wrecks have been fixed to prevent permanent disappear of Wreckage/Reclaim
Overkill Ratio on Wreckage disappearing has been changed from 10% to 30% meaning
you have to overkill said unit by 30% to not receive the wreckage Naval Reclaim
no longer gives 30% of the energy in the Wreckage
</p>
</div>
</div>

<div id="outline-container-org4722a7a" class="outline-3">
<h3 id="org4722a7a">T3 Penetration Bombers</h3>
<div class="outline-text-3" id="text-org4722a7a">
<p>
Pen Bombers are very strong, with the ability to easily punch through
most AA &amp; having cheap stealth. This change was needed to prevent early
Pen Bomber Rushes specifically in Teamgames.Many changes are aimed at
some of the first steps towards significantly diversifying units
</p>
</div>

<div id="outline-container-org63de39c" class="outline-4">
<h4 id="org63de39c">Aeon:</h4>
<div class="outline-text-4" id="text-org63de39c">
<p>
Mass Cost 4300 -&gt; 5300
Energy Cost 165000 -&gt; 195000
Stealth Energy Cost Upkeep 50 -&gt; 250
MaxAirspeed 19 -&gt; 17
MinAirspeed 15 -&gt; 14
TurnSpeed 1.0 -&gt; 1.1
</p>
</div>
</div>
