changelog/changelog.html
<div id="outline-container-org6cddda9" class="outline-4">
<h4 id="org6cddda9">UEF:</h4>
<div class="outline-text-4" id="text-org6cddda9">
<p>
Mass Cost 4750 -&gt; 5750
Energy Cost 180000 -&gt; 2100000
Stealth Energy Cost Upkeep 50 -&gt; 300
Health 6800 -&gt; 7200
MaxAirspeed 19 -&gt; 18
TurnSpeed 1.0 -&gt; 0.8
Small Yield Nuclear Bomb Damage 1900k -&gt; 1200
Lancer Standoff ASM Barrage Damage 600 -&gt; 1150
Lancer Standoff ASM Barrage DamageRadius 2 -&gt; 3.5
</p>
</div>
</div>
<div id="outline-container-orgb8a6ee2" class="outline-4">
<h4 id="orgb8a6ee2">Cybran:</h4>
<div class="outline-text-4" id="text-orgb8a6ee2">
<p>
Mass Cost 4750 -&gt; 5500
Energy Cost 180000 -&gt; 190000
Stealth Energy Cost Upkeep 50 -&gt; 300
Health 4750 -&gt; 4250
RegenRate 10 -&gt; 25
MaxAirspeed 19 -&gt; 20
MinAirspeed 15 -&gt; 16
TurnSpeed 1.0 -&gt; 1.1
</p>
</div>
</div>
<div id="outline-container-orgf97ed6e" class="outline-4">
<h4 id="orgf97ed6e">Seraphim:</h4>
<div class="outline-text-4" id="text-orgf97ed6e">
<p>
Mass Cost 4750 -&gt; 5750
Energy Cost 180000 -&gt; 195000
Stealth Energy Cost Upkeep 50 -&gt; 250
Health 6250 -&gt; 5250
MaxAirspeed 19 -&gt; 18
MinAirspeed 15 -&gt; 14
Bombs 3200 -&gt; 4200
</p>
</div>
</div>
</div>
<div id="outline-container-org723b7bf" class="outline-3">
<h3 id="org723b7bf">T3 Static Artillery</h3>
<div class="outline-text-3" id="text-org723b7bf">
<p>
Revert to the FAF Cost of T3 Static Artillery
</p>
</div>
</div>

<div id="outline-container-org51b2fbb" class="outline-3">
<h3 id="org51b2fbb">T2 Aeon Sniper</h3>
<div class="outline-text-3" id="text-org51b2fbb">
<p>
The Aeon Sniper was dominating T2, T3, and even early T4 Phase in
some games, this called for a immediate nerf.
</p>

<p>
Its main strength lies in its speed and with the reduction, it should allow
players to catch them much easier. The cost will also make them less efficient
and the EnergyRequired will make the Reload much longer as well by 3 more
seconds.
</p>

<p>
Mass Cost 320 -&gt; 465
</p>

<p>
Energy Cost 3850 -&gt; 5050
</p>

<p>
MaxSpeed 4.0 -&gt; 3.8
</p>

<p>
EnergyRequired (Recharge - Main Weapon) 880 -&gt; 1320
</p>
</div>
</div>

<div id="outline-container-org860154a" class="outline-3">
<h3 id="org860154a">T3 Mobile Sensor Arrays</h3>
<div class="outline-text-3" id="text-org860154a">
<p>
Mobile Sensor Arrays Omni was too small combined with the small omni
on static radar led to Stealth &amp; Cloak being far too powerful &amp; annoying
for players.
</p>

<p>
Energy Cost Upkeep 850 -&gt; 1500 OmniRadius 56 -&gt; 112
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2 Feb 2025</p>
<p class="author">Author: Various</p>
<p class="date">Created: 2025-02-12 Wed 02:17</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>